[{"slug":"about-plugins","title":"About Plugins","date":1442789124627,"synopsis":"We explain federated wiki plugins. We define their role interpreting content, recount our experience writing many, describe principles and strategies for future plugins, and offer a step-by-step guide for new plugin authors. We'll also collect pointers here to good plugins when they emerge."},{"slug":"about-this-site","title":"About this site","date":1522742228629,"synopsis":"This is my general federated wiki."},{"slug":"add-an-external-link","title":"Add an External Link","date":1423448738866,"synopsis":"External Links are used to provide additional information, context, or citation to a wiki article. Here we talk about when to use external links, and how to add an [[External Link]] to a page."},{"slug":"add-an-image","title":"Add an Image","date":1423178054319,"synopsis":"We've made an encyclopedic page at this point, and it's time to add some other items to it. Here we add an image."},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"assignments","title":"Assignments","date":1424389993030,"synopsis":"This is the methodology we'll be using for this Happening."},{"slug":"backup","title":"Backup","date":1497816909695,"synopsis":"You will want to make backups of the sites you own or host for others. Don't confuse the journal with a backup strategy. The journal tells others how the pages you decide to keep got the way they are. If you loose pages, the journals go with them."},{"slug":"bookmark-key-pages","title":"Bookmark Key Pages","date":1423508994832,"synopsis":"This really isn't an optional step, although people tend to skip over anything that tells them to bookmark a page. I'm not sure why."},{"slug":"browser-within-a-browser","title":"Browser Within a Browser","date":1423001778774,"synopsis":"Fedwiki (as it stands now) is a \"newer kind of browser inside an older one\" (Ward). It achieves this by using features of HTML 5."},{"slug":"choose-the-right-browser","title":"Choose the Right Browser","date":1423508325183,"synopsis":"Federated Wiki uses fairly advanced HTML to accomplish what it does. In our experience, only Chrome and Firefox provide good experiences."},{"slug":"conversations","title":"Conversations","date":1431377023896,"synopsis":"We've devised several mechanisms for recognizing and joining conversations within members of a community centered on a page title used as a topic."},{"slug":"copy-pages","title":"Copy Pages","date":1418272528830,"synopsis":"You can copy pages from remote sites into your own with a click of one button. The page becomes yours with attribution as expected."},{"slug":"create-and-claim-a-site","title":"Create and Claim a Site","date":1423508417552,"synopsis":"Down at the bottom of your page (the [[Footer]]) there is a blue button (the [[Login]]). On systems running our Node code, it will say either \"Sign In\" \"Sign Out\" or \"Claim with your Email\"."},{"slug":"data","title":"Data","date":1438527367013,"synopsis":"We describe what data wiki stores, how it is kept, what you can change, and what happens when you do."},{"slug":"data-not-layout","title":"Data not Layout","date":1423333332525,"synopsis":"Pages are stored on federated wiki sites as JSON, a simple, easily parseable data format. You can see what this format looks like by clicking JSON at the bottom of the page."},{"slug":"discoverable-but-not-obvious","title":"Discoverable but not Obvious","date":1423771876859,"synopsis":"Identity and citation has to be discoverable -- that's part of the deal, the BY in the CC-BY-SA. But it does not follow that citation should be obvious. In fact, there are many reasons to to background citation."},{"slug":"embed-video","title":"Embed Video","date":1423266509800,"synopsis":"Embedding video is similar to adding an image. Instead of dragging and dropping an image onto [[Factory]], however, you are going to drag and drop a URL."},{"slug":"execute-a-cross-page-move","title":"Execute a Cross-Page Move","date":1423588296537,"synopsis":"You can drag paragraphs up and down. Try it with these paragraphs. Click, hold, drag, then drop."},{"slug":"federated-wiki-knowledge-cycle","title":"Federated Wiki knowledge cycle","date":1454422887295,"synopsis":"Some examples:"},{"slug":"federated-wiki-on-digital-ocean","title":"Federated Wiki on Digital Ocean","date":1511084078168,"synopsis":"At some point you may want to run your own Federated Wiki site, or perhaps set one up  for friends or a class. We've had good luck installing on Digital Ocean, which currently offers very cheap hosting and a much simpler setup than services such as Amazon Web Services."},{"slug":"federated-wiki-sites","title":"Federated Wiki Sites","date":1454412653874,"synopsis":"A page with 0 items."},{"slug":"federation","title":"Federation","date":1422997537660,"synopsis":"Federation gets title billing in the name. It is one of the key features, but not the only one."},{"slug":"federation-rest-services","title":"Federation REST Services","date":1451355019107,"synopsis":"Members of the Federation provide simple CGI's on a server they own, programmed in whatever language they prefer, which responds at the URL specified with [[Fedwiki Page Json]]."},{"slug":"fedwiki-sites","title":"Fedwiki Sites","date":1503060238025,"synopsis":"Follow  [[Changes to this Site]], or [[Changes to Fedwiki Sites]], to see what we are [[Currently Working On]]. Use [[Fedwiki Tools]] to author new content."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1522145836727,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find deleted pages."},{"slug":"field-guide-to-the-federation","title":"Field Guide to the Federation","date":1522160266028,"synopsis":"We show you what we find interesting in the federation and suggest how you can make yourself at home here."},{"slug":"find-sites","title":"Find Sites","date":1488041808021,"synopsis":"When you find a federated wiki site you can browse from there to even more sites. A page from a site becomes yours when you copy it (a fork) leaving a trail back to the source and its neighbors."},{"slug":"find-the-beginning","title":"Find The Beginning","date":1499134250463,"synopsis":"The first page of any site is called Welcome Visitors. It is the page you see if you specify no other page in a site's URL. One click takes you to this page for any site."},{"slug":"forking","title":"Forking","date":1422997632140,"synopsis":"Forking is a technical term, derived from the sort of fork in the phrase \"a fork in the road\". It's \"to split off\"."},{"slug":"history-travels-with-page","title":"History Travels With Page","date":1423002547061,"synopsis":"Because federated wiki pages travel between servers frequently, we can't rely on the server to maintain page histories. Therefore the history of each federated wiki page travels with each page."},{"slug":"hosting","title":"Hosting","date":1501556213211,"synopsis":"A computer with a modern operating system and networking software can host the wiki server. This combination of resources can be found in many places."},{"slug":"how-to-add-plugins","title":"How to Add Plugins","date":1454423256223,"synopsis":"The fed.wiki.org family of servers have been configured with a variety of plugins, many of which were experiments built to test the plugin concepts. User-oriented documentation is included in the server's how-to pages."},{"slug":"how-to-wiki","title":"How To Wiki","date":1522221810665,"synopsis":"Here we describe how to use the web interface to the federated wiki. Read [[About Federated Wiki]] to learn about the project. If you are just starting to write in your first wiki then read the [[Field Guide to the Federation]]."},{"slug":"hypertext-history","title":"Hypertext History","date":1424220251152,"synopsis":"Assignment is below. If you have not done an assignment yet, you should look see [[Assignments]]."},{"slug":"ideas-of-federated-wiki","title":"Ideas of Federated Wiki","date":1423008702213,"synopsis":"Federated Wiki combines a few powerful, well-chosen ideas. It's helpful to know what these are. Most of these ideas exist someplace else, the particular power is the combination of the ideas in a single environment."},{"slug":"imagine-transport","title":"Imagine Transport","date":1522143680433,"synopsis":"<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>"},{"slug":"in-a-nutshell","title":"In a Nutshell","date":1423446914649,"synopsis":"Federated Wiki is less like Microsoft Word, and more like Excel."},{"slug":"incremental-pages","title":"Incremental Pages","date":1522094592581,"synopsis":"A wiki buds new pages as the need for them emerges. At this point in creation we challenge our future selves to thoughts beyond our immediate needs else the new remains only a footnote to the old."},{"slug":"incremental-paragraphs","title":"Incremental Paragraphs","date":1522103182494,"synopsis":"A complete thought is more important than a complete sentence. Write to be read in progress. Expect your work to be consumed and discarded before it is finished."},{"slug":"journal","title":"Journal","date":1522057157977,"synopsis":"[[Why Journal]]"},{"slug":"journal-2016","title":"Journal 2016","date":1454581709051,"synopsis":"[[2016-02]]"},{"slug":"journal-2018","title":"journal-2018","date":1522057372065,"synopsis":"[[Journal 2018-03]]"},{"slug":"journal-2018-03","title":"Journal 2018-03","date":1522057564206,"synopsis":"## 2018-03-26"},{"slug":"julian-elve","title":"Julian Elve","date":1522061747740,"synopsis":"[https://twitter.com/Synesthesia @synesthesia]"},{"slug":"know-possible-traps","title":"Know Possible Traps","date":1423160832532,"synopsis":"Federated Wiki should be regarded as a Developer Release or Technology Preview. Expect certain things to go wrong. Roll with it...."},{"slug":"learn-shift-click-magic","title":"Learn Shift-Click Magic","date":1423420575219,"synopsis":"Modifier keys are used heavily in Federated Wiki. Shift-click is one such modifier key. To use it, hold down your shift key while executing your normal click action."},{"slug":"lineup","title":"Lineup","date":1440986154602,"synopsis":"The lineup is the list of wiki pages currently displayed within one tab, in order, with duplication possible."},{"slug":"lineup-links","title":"LineUp Links","date":1522147047749,"synopsis":"Presently [[wiki links]] implement internal links within [[the federation]], using a mechanism we call [[collaborative links]]. Here I outline a proposal to extend this mechanism to enable wiki links to open a number of lineup pages."},{"slug":"maintaining-a-custom-wiki","title":"Maintaining a Custom Wiki","date":1446820861652,"synopsis":"You will want to include your custom plugins in some or all of the servers you operate. Here we explore various workflows that simplify this task."},{"slug":"make-an-encyclopedic-page","title":"Make an Encyclopedic Page","date":1423589608371,"synopsis":"In this activity we will make a simple encyclopedic page."},{"slug":"make-an-index-page","title":"Make an Index Page","date":1423530313650,"synopsis":"Index pages are used as entry points into your site's content. In pedagogical uses of federated wiki it can also function as a portfolio of student work. Here we show you how to make one."},{"slug":"make-your-bio-page","title":"Make Your Bio Page","date":1423177730902,"synopsis":"Your bio page helps users to understand who you are and why you might be running this site. This is how to make one."},{"slug":"molecular-paragraphs","title":"Molecular Paragraphs","date":1423097578257,"synopsis":"In federated wiki the lowly paragraph (and in a broader sense the 'item') has a special place. Paragraphs have their own IDs and edit histories. They are draggable. They can define diferent formats (Markdown, HTML, Plain Text) and still live on the same page."},{"slug":"my-wikis","title":"My Wikis","date":1522741952132,"synopsis":"My federated wikis (click the >> to add these sites to your search neighbourhood)"},{"slug":"names-of-things","title":"Names of Things","date":1423066945612,"synopsis":"We throw around a lot of terms when we talk about federated wiki that come from a variety of sources. Here we look at the sources and mention the most common names they provide."},{"slug":"neighborhood","title":"Neighborhood","date":1423058702902,"synopsis":"The neighborhood is the list of sites seen while browsing within one tab. The site's flags are shown in the footer."},{"slug":"networking","title":"Networking","date":1500753770761,"synopsis":"We describe how wiki hooks up to the network because it does so through mechanisms not so frequently used by end users browsing the web."},{"slug":"parallel-pages","title":"Parallel Pages","date":1423009464173,"synopsis":"We call this idea \"Parallel Pages\" but it's really a bigger idea than that. We just don't have a name for it."},{"slug":"people-i-read","title":"People I read","date":1522160609864,"synopsis":"To add a site (or collection of sites) to the search neighbourhood for the current session, click the >> at the end of each row"},{"slug":"personal-knowledge-management","title":"Personal Knowledge Management","date":1454580673252,"synopsis":"Pretty empty right now - I want to explore [[Federated Wiki]] as a tool for supporting PKM, especially Harold Jarche's [http://jarche.com/2014/02/the-seek-sense-share-framework/ Seek Sense Share Framework]"},{"slug":"read-a-journal-history","title":"Read a Journal History","date":1423600478651,"synopsis":"You've probably noticed (how could you not?) that there are some weird symbols at the bottom of the Federated wiki page. This section is called the [[Journal]] and it can be extremely useful to you. Here's how it works."},{"slug":"read-history","title":"Read History","date":1488039848266,"synopsis":"The gray squares at the bottom of a page is in an area called the [[Journal]]. Click a square to see other versions of the page."},{"slug":"relocating","title":"Relocating","date":1434120722466,"synopsis":"We consider how one might move a whole site and why that might be necessary."},{"slug":"rosters","title":"Rosters","date":1435282720574,"synopsis":"A roster is any list of sites assembled for the purpose of sharing. We describe common mechanisms for assembling and managing rosters."},{"slug":"search-sites","title":"Search Sites","date":1499138398334,"synopsis":"Search looks at the title and first paragraph of all pages in your [[Neighborhood]]. As you browse the federation more sites are added to your neighborhood so search can find more pages."},{"slug":"security","title":"Security","date":1438329016381,"synopsis":"A site can be owned, or not. If it is owned we ask two simple questions \"Who Are You?\" and \"Are You The Site Owner?\". The separation of these two questions is important, as we will see."},{"slug":"site-index","title":"Site Index","date":1454425438178,"synopsis":"SORT titles"},{"slug":"sitesfedwikiorg","title":"sites.fed.wiki.org","date":1387151905542,"synopsis":"Catalog of federated wiki sites with domain names for page titles and brief descriptions tuned for search."},{"slug":"social","title":"Social","date":1434119621243,"synopsis":"People create pages and move them through the federation. We control who writes on sites and servers we own. We observe who reads and forks each other's work and intervene to make this a productive activity."},{"slug":"statemode","title":"StateMode","date":1522060257000,"synopsis":"cf [[StreamMode]]"},{"slug":"streammode","title":"StreamMode","date":1522060270929,"synopsis":"*StreamMode (that running serialization that sees all things as sequenced speech events)*"},{"slug":"technical-notes","title":"Technical Notes","date":1522160820207,"synopsis":"Installing Federated Wiki"},{"slug":"technology-sites","title":"Technology Sites","date":1454426297237,"synopsis":"A page with 1 items."},{"slug":"things-you-must-do","title":"Things You Must Do","date":1424306424045,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Here we link you directly to the things you must be do/be able to do before the March Happening, in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"thinking-vs-writing","title":"Thinking vs. Writing","date":1420343519324,"synopsis":"We compare the thought process of problem solving to those of reporting solutions."},{"slug":"tips-for-administrators","title":"Tips for Administrators","date":1437698819956,"synopsis":"Here we collect advice for operating wiki sites for others. Computers and networks vary so we stop short of step by step instructions. We report what has worked for us using the privileges available to system administrators."},{"slug":"track-changes","title":"Track Changes","date":1418315338671,"synopsis":"You can always edit. Your edits will be stored in the browser or on the origin server if you've logged in."},{"slug":"transport-plugin","title":"Transport Plugin","date":1451555653265,"synopsis":"The Transport Plugin is the name given to the plugin idea initially described here:"},{"slug":"understand-welcome-visitors","title":"Understand Welcome Visitors","date":1423509751134,"synopsis":"Welcome Visitors is one of a few special system pages. Welcome Visitors is meant to identify what your site is about to others. It also may function as a personal landing page. See [[Special Page Names]]"},{"slug":"use-arrow-keys","title":"Use Arrow Keys","date":1423267115029,"synopsis":"This is an easy one. We're going to learn how to use keys to navigate. See [[What Arrow Keys Look Like]]."},{"slug":"use-conversation-clubs","title":"Use Conversation Clubs","date":1423777847407,"synopsis":"You should have a \"Conversation Clubs\" link on your site from previous steps in the orientation."},{"slug":"using-a-wiki-for-your-notebook","title":"Using a Wiki For your Notebook","date":1454581575506,"synopsis":"[http://webseitz.fluxent.com/ Bill Seitz] says:"},{"slug":"using-federated-wiki","title":"Using Federated Wiki","date":1454431944121,"synopsis":"Mike Caulfield runs federated Wiki \"Happenings\" - here are some very useful basic notes:"},{"slug":"view-remote-pages","title":"View Remote Pages","date":1423509657525,"synopsis":"You've probably noticed that some of these pages have a \"blue halo\" around them. This means that the data of the page is being served from a server other than the one from which you're browsing (your [[Origin Site]])."},{"slug":"virtues-of-wiki","title":"Virtues of Wiki","date":1423006428713,"synopsis":"First, federated wiki inherits the virtues of wiki:"},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1522742529126,"synopsis":"Welcome to this [[Federated Wiki]] site - personal site for [[Julian Elve]]. I am using this for general note-taking and experiments with [[Federated Wiki]]. I also have a couple of subject-specific areas:"},{"slug":"why-journal","title":"Why Journal","date":1454581690257,"synopsis":"[[Why use Federated Wiki for journalling]]"},{"slug":"why-use-federated-wiki-for-journalling","title":"Why use Federated Wiki for journalling","date":1454581690260,"synopsis":"I think [[Federated Wiki]] has huge potential for  using as a journal that escapes the constraints of [[StreamMode]]"}]