[{"slug":"about-page","title":"About Page","date":1495379003452,"synopsis":"About pages contain documentation for plugins that becomes accessible at a sites when each plugin is installed. An about page title is constructed from the plugin name surrounded by \"About\" and \"Plugin\"."},{"slug":"about-plugins","title":"About Plugins","date":1442789124627,"synopsis":"We explain federated wiki plugins. We define their role interpreting content, recount our experience writing many, describe principles and strategies for future plugins, and offer a step-by-step guide for new plugin authors. We'll also collect pointers here to good plugins when they emerge."},{"slug":"about-reference-plugin","title":"About Reference Plugin","date":1538723981681,"synopsis":"References are paragraphs that are used as bibliographic references to pages elsewhere in the federation. References can bypass the usual link resolution process to go straight to a remote site."},{"slug":"about-this-site","title":"About this site","date":1563258861268,"synopsis":"This is my general federated wiki."},{"slug":"abstraction-of-method","title":"Abstraction of Method","date":1418598926711,"synopsis":"We reflect on the various ways this wiki separates method from quantity such that what will be done can be considered independently from the doing. We focus on dispatch as a kind of condition that is open to an increasing number of alternatives that will be managed by other than the immediate programmer. See also [[Upper Name Hierarchy]]."},{"slug":"action","title":"Action","date":1423065117772,"synopsis":"An Action records a human activity that changes or copies a page. Actions are of a small number of types that apply to all pages and their items."},{"slug":"add-an-external-link","title":"Add an External Link","date":1423448738866,"synopsis":"External Links are used to provide additional information, context, or citation to a wiki article. Here we talk about when to use external links, and how to add an [[External Link]] to a page."},{"slug":"add-an-image","title":"Add an Image","date":1423178054319,"synopsis":"We've made an encyclopedic page at this point, and it's time to add some other items to it. Here we add an image."},{"slug":"add-button","title":"Add Button","date":1423372343390,"synopsis":"The Add Button is used to add new items to a page."},{"slug":"add-links","title":"Add Links","date":1488073420214,"synopsis":"Wiki recognizes two different kinds of links. Both are identified by enclosing text within square brackets."},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"assignments","title":"Assignments","date":1424389993030,"synopsis":"This is the methodology we'll be using for this Happening."},{"slug":"backup","title":"Backup","date":1497816909695,"synopsis":"You will want to make backups of the sites you own or host for others. Don't confuse the journal with a backup strategy. The journal tells others how the pages you decide to keep got the way they are. If you loose pages, the journals go with them."},{"slug":"bibliography","title":"Bibliography","date":1423066174552,"synopsis":"Here we list other places where we have defined terms used mostly when programming the wiki itself."},{"slug":"bookmark-key-pages","title":"Bookmark Key Pages","date":1423508994832,"synopsis":"This really isn't an optional step, although people tend to skip over anything that tells them to bookmark a page. I'm not sure why."},{"slug":"browser-within-a-browser","title":"Browser Within a Browser","date":1423001778774,"synopsis":"Fedwiki (as it stands now) is a \"newer kind of browser inside an older one\" (Ward). It achieves this by using features of HTML 5."},{"slug":"choose-the-right-browser","title":"Choose the Right Browser","date":1423508325183,"synopsis":"Federated Wiki uses fairly advanced HTML to accomplish what it does. In our experience, only Chrome and Firefox provide good experiences."},{"slug":"coding-folks","title":"Coding Folks","date":1419111026860,"synopsis":"If you're talking about federated wiki code, add your site here and you will be heard sooner. You can, but need not, use the same site as the happening."},{"slug":"coding-tips","title":"Coding Tips","date":1420345583481,"synopsis":"Even simple things require a few steps in the [[Federated Wiki]] code. Here I remind myself how to get things done."},{"slug":"common-names","title":"Common Names","date":1420345640112,"synopsis":"We describe names we use (or would like to use) and the conventions that produce them. These evolve. Newer conventions are marked ☼."},{"slug":"computational-plugins","title":"Computational Plugins","date":1420343443272,"synopsis":"We wanted wiki to be able to compute. These plugins developed our notion of cooperating computational engines."},{"slug":"context","title":"Context","date":1423846411507,"synopsis":"An internal link's Context provides a path to be searched when the link is clicked. The origin, the remote site, the reference cite and forks in the journal all contribute to the context."},{"slug":"conversations","title":"Conversations","date":1431377023896,"synopsis":"We've devised several mechanisms for recognizing and joining conversations within members of a community centered on a page title used as a topic."},{"slug":"copy-pages","title":"Copy Pages","date":1418272528830,"synopsis":"You can copy pages from remote sites into your own with a click of one button. The page becomes yours with attribution as expected."},{"slug":"create-and-claim-a-site","title":"Create and Claim a Site","date":1423508417552,"synopsis":"Down at the bottom of your page (the [[Footer]]) there is a blue button (the [[Login]]). On systems running our Node code, it will say either \"Sign In\" \"Sign Out\" or \"Claim with your Email\"."},{"slug":"data","title":"Data","date":1438527367013,"synopsis":"We describe what data wiki stores, how it is kept, what you can change, and what happens when you do."},{"slug":"data-not-layout","title":"Data not Layout","date":1423333332525,"synopsis":"Pages are stored on federated wiki sites as JSON, a simple, easily parseable data format. You can see what this format looks like by clicking JSON at the bottom of the page."},{"slug":"delete-pages","title":"Delete Pages","date":1438528041767,"synopsis":"We can delete pages from the [[Dot Wiki]] files even though the wiki server itself won't (yet) do this."},{"slug":"discoverable-but-not-obvious","title":"Discoverable but not Obvious","date":1423771876859,"synopsis":"Identity and citation has to be discoverable -- that's part of the deal, the BY in the CC-BY-SA. But it does not follow that citation should be obvious. In fact, there are many reasons to to background citation."},{"slug":"dns-wildcard","title":"DNS Wildcard","date":1375982701533,"synopsis":"The internet's domain name system (dns) allows for * to represent all possible subdomains of a given domain name. We use wildcard dns records to direct all subdomains of fed.wiki.org to a single server, a wiki farm."},{"slug":"dot-wiki","title":"Dot Wiki","date":1437700131790,"synopsis":"Wiki manages pages saved as json text and often kept in flat files. It also keeps some additional state, metadata, related to identity such as login details and a favicon flag."},{"slug":"drag","title":"Drag","date":1423783225465,"synopsis":"The Drag is the first part of a drag and drop operation.  We drag a thing to a place. When we call out drag specifically we are calling attention to the thing that is the subject of the operation. See [[Drop]]"},{"slug":"drop","title":"Drop","date":1423783889949,"synopsis":"A Drop completes an operation started by selecting something to drag. What happens will depend on what is dragged and where it is dropped. See [[Drag]]"},{"slug":"embed-video","title":"Embed Video","date":1423266509800,"synopsis":"Embedding video is similar to adding an image. Instead of dragging and dropping an image onto [[Factory]], however, you are going to drag and drop a URL."},{"slug":"execute-a-cross-page-move","title":"Execute a Cross-Page Move","date":1423588296537,"synopsis":"You can drag paragraphs up and down. Try it with these paragraphs. Click, hold, drag, then drop."},{"slug":"external-link","title":"External Link","date":1423802204467,"synopsis":"An External Link refers to web pages to be open in a new tab based on a url which might be long and confusing. External links provide a short visible form, often just one word, that identifies the type of material to be found when clicking the link."},{"slug":"factory","title":"Factory","date":1423065405243,"synopsis":"A factory is a type of item that is meant to become some other type eventually."},{"slug":"featured-documentation","title":"Featured Documentation","date":1465759498791,"synopsis":"We write a lot about how things work here creating new sites for each subject area or nature of interest."},{"slug":"featured-sites","title":"Featured Sites","date":1465760357601,"synopsis":"You can browse to any of these sites without leaving your own. Always start at your own site so that anything you find that you want to keep can be forked to there."},{"slug":"federated-wiki-knowledge-cycle","title":"Federated Wiki knowledge cycle","date":1454422887295,"synopsis":"Some examples:"},{"slug":"federated-wiki-on-digital-ocean","title":"Federated Wiki on Digital Ocean","date":1511084078168,"synopsis":"At some point you may want to run your own Federated Wiki site, or perhaps set one up  for friends or a class. We've had good luck installing on Digital Ocean, which currently offers very cheap hosting and a much simpler setup than services such as Amazon Web Services."},{"slug":"federated-wiki-sites","title":"Federated Wiki Sites","date":1454412653874,"synopsis":"A page with 0 items."},{"slug":"federation","title":"Federation","date":1422997537660,"synopsis":"Federation gets title billing in the name. It is one of the key features, but not the only one."},{"slug":"federation-rest-services","title":"Federation REST Services","date":1451355019107,"synopsis":"Members of the Federation provide simple CGI's on a server they own, programmed in whatever language they prefer, which responds at the URL specified with [[Fedwiki Page Json]]."},{"slug":"fedwiki-sites","title":"Fedwiki Sites","date":1503060238025,"synopsis":"Follow  [[Changes to this Site]], or [[Changes to Fedwiki Sites]], to see what we are [[Currently Working On]]. Use [[Fedwiki Tools]] to author new content."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1522145836727,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content. Check [[Recycled pages]] to find deleted pages."},{"slug":"field-guide-to-the-federation","title":"Field Guide to the Federation","date":1522160266028,"synopsis":"We show you what we find interesting in the federation and suggest how you can make yourself at home here."},{"slug":"find-sites","title":"Find Sites","date":1488041808021,"synopsis":"When you find a federated wiki site you can browse from there to even more sites. A page from a site becomes yours when you copy it (a fork) leaving a trail back to the source and its neighbors."},{"slug":"find-the-beginning","title":"Find The Beginning","date":1499134250463,"synopsis":"The first page of any site is called Welcome Visitors. It is the page you see if you specify no other page in a site's URL. One click takes you to this page for any site."},{"slug":"flag","title":"Flag","date":1423370527801,"synopsis":"The Flag is the small square of color used to identify a site within the federation."},{"slug":"footer","title":"Footer","date":1423055767351,"synopsis":"The footer of the web page shows information about the browsing activity within one tab."},{"slug":"fork-button","title":"Fork Button","date":1423372650754,"synopsis":"The Fork Button is used to copy a page to the [[Origin]] site."},{"slug":"forking","title":"Forking","date":1422997632140,"synopsis":"Forking is a technical term, derived from the sort of fork in the phrase \"a fork in the road\". It's \"to split off\"."},{"slug":"future","title":"Future","date":1423842219874,"synopsis":"A Future item describes how a missing page can be found or created. Unresolved internal links add a ghost page with a future to the lineup."},{"slug":"ghost","title":"Ghost","date":1494947127771,"synopsis":"A wiki page is rendered with a translucent background when that page exists only in the browser as a ghost of a page that has been or will soon be."},{"slug":"history-travels-with-page","title":"History Travels With Page","date":1423002547061,"synopsis":"Because federated wiki pages travel between servers frequently, we can't rely on the server to maintain page histories. Therefore the history of each federated wiki page travels with each page."},{"slug":"hosting","title":"Hosting","date":1501556213211,"synopsis":"A computer with a modern operating system and networking software can host the wiki server. This combination of resources can be found in many places."},{"slug":"how-to-add-plugins","title":"How to Add Plugins","date":1454423256223,"synopsis":"The fed.wiki.org family of servers have been configured with a variety of plugins, many of which were experiments built to test the plugin concepts. User-oriented documentation is included in the server's how-to pages."},{"slug":"how-to-wiki","title":"How To Wiki","date":1538686204765,"synopsis":"Here we describe how to use the web interface to the federated wiki. Read [[About Federated Wiki]] to learn about the project. If you are just starting to write in your first wiki then read the [[Field Guide to the Federation]]."},{"slug":"hypertext-history","title":"Hypertext History","date":1424220251152,"synopsis":"Assignment is below. If you have not done an assignment yet, you should look see [[Assignments]]."},{"slug":"ideas-of-federated-wiki","title":"Ideas of Federated Wiki","date":1423008702213,"synopsis":"Federated Wiki combines a few powerful, well-chosen ideas. It's helpful to know what these are. Most of these ideas exist someplace else, the particular power is the combination of the ideas in a single environment."},{"slug":"imagine-transport","title":"Imagine Transport","date":1522143680433,"synopsis":"<script async src=\"//platform.twitter.com/widgets.js\" charset=\"utf-8\"></script>"},{"slug":"import-documents","title":"Import Documents","date":1420512843820,"synopsis":"Federated wiki is just one more document format that hopes to play well with others and bring something new to the party."},{"slug":"in-a-nutshell","title":"In a Nutshell","date":1423446914649,"synopsis":"Federated Wiki is less like Microsoft Word, and more like Excel."},{"slug":"incremental-pages","title":"Incremental Pages","date":1522094592581,"synopsis":"A wiki buds new pages as the need for them emerges. At this point in creation we challenge our future selves to thoughts beyond our immediate needs else the new remains only a footnote to the old."},{"slug":"incremental-paragraphs","title":"Incremental Paragraphs","date":1522103182494,"synopsis":"A complete thought is more important than a complete sentence. Write to be read in progress. Expect your work to be consumed and discarded before it is finished."},{"slug":"interface-names","title":"Interface Names","date":1494947245919,"synopsis":"The user interface presents information in graphical forms. We often refer to these forms by the same names as the information."},{"slug":"internal-link","title":"Internal Link","date":1423802255323,"synopsis":"An Internal Link retrieves and displays another wiki page based on the title in the link and the context in which it has been found. See [[Context]]"},{"slug":"join","title":"Join","date":1423801253779,"synopsis":"A Join merges two items of type paragraph into one when a backspace/delete is typed and the cursor is placed such that the space between paragraphs is what should be erased."},{"slug":"journal","title":"Journal","date":1522931693939,"synopsis":"A wiki page has a journal that records the history of how the page was made and where it has traveled."},{"slug":"json-schema","title":"JSON Schema","date":1418516871338,"synopsis":"We define the schema for federated wiki pages to the depth that we know it. We use a BNF-like notation to suggest JSON elements. Any ambiguity will be resolved by examining the example. We close with a brief reflection on the successes of the format."},{"slug":"julian-elve","title":"Julian Elve","date":1560263576841,"synopsis":"Uploaded image"},{"slug":"know-possible-traps","title":"Know Possible Traps","date":1423160832532,"synopsis":"Federated Wiki should be regarded as a Developer Release or Technology Preview. Expect certain things to go wrong. Roll with it...."},{"slug":"learn-shift-click-magic","title":"Learn Shift-Click Magic","date":1423420575219,"synopsis":"Modifier keys are used heavily in Federated Wiki. Shift-click is one such modifier key. To use it, hold down your shift key while executing your normal click action."},{"slug":"lineup","title":"Lineup","date":1440986154602,"synopsis":"The lineup is the list of wiki pages currently displayed within one tab, in order, with duplication possible."},{"slug":"lineup-links","title":"LineUp Links","date":1522147047749,"synopsis":"Presently [[wiki links]] implement internal links within [[the federation]], using a mechanism we call [[collaborative links]]. Here I outline a proposal to extend this mechanism to enable wiki links to open a number of lineup pages."},{"slug":"link-word","title":"Link Word","date":1418937425265,"synopsis":"Wiki has a distinct markup for links that go to pages outside the wiki. Here we suggest a style for using that markup that suites both writer and reader."},{"slug":"location","title":"Location","date":1423055460499,"synopsis":"The location field of the browser shows the URL of the web page that it is viewing. One can edit the location to change what is viewed."},{"slug":"login","title":"Login","date":1423056281647,"synopsis":"The login region of the footer shows who can login, if they are logged in and how to login."},{"slug":"maintaining-a-custom-wiki","title":"Maintaining a Custom Wiki","date":1446820861652,"synopsis":"You will want to include your custom plugins in some or all of the servers you operate. Here we explore various workflows that simplify this task."},{"slug":"make-an-encyclopedic-page","title":"Make an Encyclopedic Page","date":1423589608371,"synopsis":"In this activity we will make a simple encyclopedic page."},{"slug":"make-an-index-page","title":"Make an Index Page","date":1423530313650,"synopsis":"Index pages are used as entry points into your site's content. In pedagogical uses of federated wiki it can also function as a portfolio of student work. Here we show you how to make one."},{"slug":"make-your-bio-page","title":"Make Your Bio Page","date":1423177730902,"synopsis":"Your bio page helps users to understand who you are and why you might be running this site. This is how to make one."},{"slug":"molecular-paragraphs","title":"Molecular Paragraphs","date":1423097578257,"synopsis":"In federated wiki the lowly paragraph (and in a broader sense the 'item') has a special place. Paragraphs have their own IDs and edit histories. They are draggable. They can define diferent formats (Markdown, HTML, Plain Text) and still live on the same page."},{"slug":"move-pages","title":"Move Pages","date":1438527923231,"synopsis":"We can move misplaced pages between sites without leaving a confusing trail of forks by moving the files within the [[Dot Wiki]] directories."},{"slug":"my-journal","title":"My Journal","date":1522745370243,"synopsis":"[https://forage.wiki.synesthesia.co.uk/view/welcome-visitors/view/my-journal preferred page]"},{"slug":"my-wikis","title":"My Wikis","date":1522741952132,"synopsis":"My federated wikis (click the >> to add these sites to your search neighbourhood)"},{"slug":"names-of-things","title":"Names of Things","date":1423066945612,"synopsis":"We throw around a lot of terms when we talk about federated wiki that come from a variety of sources. Here we look at the sources and mention the most common names they provide."},{"slug":"neighborhood","title":"Neighborhood","date":1466333619315,"synopsis":"The neighborhood is the list of sites seen while browsing within one tab. The site's flags are shown in the footer."},{"slug":"networking","title":"Networking","date":1500753770761,"synopsis":"We describe how wiki hooks up to the network because it does so through mechanisms not so frequently used by end users browsing the web."},{"slug":"networking-names","title":"Networking Names","date":1420997591622,"synopsis":"The federated wiki has been implemented on top of services provided by the internet, the world-wide-web and the various browsers built for it."},{"slug":"origin","title":"Origin","date":1433615897187,"synopsis":"The Origin is the site from which we started browsing the federated wiki within a given tab. The origin is first among equals wielding some unexpected power over our experience."},{"slug":"package-names","title":"Package Names","date":1420997247906,"synopsis":"The popular federated wiki application is written in a dialect of javascript and distributed as a collection of packages in npm (node package manager) which gives them names."},{"slug":"page-flag","title":"Page Flag","date":1423370722405,"synopsis":"The Page Flag identifies the site from which a page has been retrieved. A page is larger than most flags and appears in the upper left corner of every page just to the left of the page title."},{"slug":"page-place-clues","title":"Page Place Clues","date":1440985937172,"synopsis":"Wiki renders pages with visual clues as to where they have been found."},{"slug":"paragraph","title":"Paragraph","date":1423065709640,"synopsis":"A paragraph is one type of item in a story written in the simplest and most preferred markup consisting of just words and links."},{"slug":"parallel-pages","title":"Parallel Pages","date":1423009464173,"synopsis":"We call this idea \"Parallel Pages\" but it's really a bigger idea than that. We just don't have a name for it."},{"slug":"people-i-read","title":"People I read","date":1538723555971,"synopsis":"To add a site (or collection of sites) to the search neighbourhood for the current session, click the >> at the end of each row"},{"slug":"personal-knowledge-management","title":"Personal Knowledge Management","date":1454580673252,"synopsis":"Pretty empty right now - I want to explore [[Federated Wiki]] as a tool for supporting PKM, especially Harold Jarche's [http://jarche.com/2014/02/the-seek-sense-share-framework/ Seek Sense Share Framework]"},{"slug":"plugin-names","title":"Plugin Names","date":1495374743155,"synopsis":"Federated wiki composes pages from items of various types. A wiki server is configured with plugins to render and operate each item it encounters as best it can."},{"slug":"read-a-journal-history","title":"Read a Journal History","date":1423600478651,"synopsis":"You've probably noticed (how could you not?) that there are some weird symbols at the bottom of the Federated wiki page. This section is called the [[Journal]] and it can be extremely useful to you. Here's how it works."},{"slug":"read-history","title":"Read History","date":1488039848266,"synopsis":"The gray squares at the bottom of a page is in an area called the [[Journal]]. Click a square to see other versions of the page."},{"slug":"recent-changes","title":"Recent Changes","date":1362955694011,"synopsis":"Here we list neighborhood pages with those most recently changed listed first. See also [[Local Changes]]."},{"slug":"reference","title":"Reference","date":1423803215807,"synopsis":"A Reference cites a wiki page from a specific site. A flag within the reference links directly to the page on the remote site. Internal links in the reference title and marked up text will include the reference site in their context."},{"slug":"relocating","title":"Relocating","date":1434120722466,"synopsis":"We consider how one might move a whole site and why that might be necessary."},{"slug":"rosters","title":"Rosters","date":1435282720574,"synopsis":"A roster is any list of sites assembled for the purpose of sharing. We describe common mechanisms for assembling and managing rosters."},{"slug":"search","title":"Search","date":1423057213678,"synopsis":"Search will look for pages within the neighborhood. The count of available pages is shown and changes with browsing."},{"slug":"search-sites","title":"Search Sites","date":1499138398334,"synopsis":"Search looks at the title and first paragraph of all pages in your [[Neighborhood]]. As you browse the federation more sites are added to your neighborhood so search can find more pages."},{"slug":"security","title":"Security","date":1438329016381,"synopsis":"A site can be owned, or not. If it is owned we ask two simple questions \"Who Are You?\" and \"Are You The Site Owner?\". The separation of these two questions is important, as we will see."},{"slug":"site-index","title":"Site Index","date":1454425438178,"synopsis":"SORT titles"},{"slug":"sitesfedwikiorg","title":"sites.fed.wiki.org","date":1387151905542,"synopsis":"Catalog of federated wiki sites with domain names for page titles and brief descriptions tuned for search."},{"slug":"social","title":"Social","date":1434119621243,"synopsis":"People create pages and move them through the federation. We control who writes on sites and servers we own. We observe who reads and forks each other's work and intervene to make this a productive activity."},{"slug":"special-interest-groups","title":"Special Interest Groups","date":1538724023419,"synopsis":"Save time refreshing Recent Changes by narrowing your neighborhood with one or more of these SIGs."},{"slug":"special-page-names","title":"Special Page Names","date":1425330316671,"synopsis":"Some names and naming conventions are wired into wiki client and server side code. We would like to discourage further pollution of this namespace."},{"slug":"split","title":"Split","date":1423801068229,"synopsis":"A Split divides a paragraph item into two at the point of the cursor upon typing the return/enter key."},{"slug":"statemode","title":"StateMode","date":1522060257000,"synopsis":"cf [[StreamMode]]"},{"slug":"storage-name","title":"Storage Name","date":1433618552145,"synopsis":"Wiki URLs include both sites and slugs identifying what pages are wanted and where to find them. Storage names substitute for site names when some special addressing is expected."},{"slug":"streammode","title":"StreamMode","date":1522060270929,"synopsis":"*StreamMode (that running serialization that sees all things as sequenced speech events)*"},{"slug":"synopsis","title":"Synopsis","date":1423057869876,"synopsis":"A wiki pages has a synopsis that is shown with the page title in a search result."},{"slug":"tab-flag","title":"Tab Flag","date":1423371076407,"synopsis":"The Tab Flag appears in places the browser expects a site icon sometimes called a 'favicon'. The flag that shows on a browser tab identifies the 'origin', the site where edits will be saved."},{"slug":"technical-notes","title":"Technical Notes","date":1522160820207,"synopsis":"Installing Federated Wiki"},{"slug":"technology-sites","title":"Technology Sites","date":1454426297237,"synopsis":"A page with 1 items."},{"slug":"template","title":"Template","date":1423063195707,"synopsis":"A Template page provides items as a guild for new pages intended to follow a prepared format."},{"slug":"things-you-must-do","title":"Things You Must Do","date":1424306424045,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Here we link you directly to the things you must be do/be able to do before the March Happening, in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"thinking-vs-writing","title":"Thinking vs. Writing","date":1420343519324,"synopsis":"We compare the thought process of problem solving to those of reporting solutions."},{"slug":"tips-for-administrators","title":"Tips for Administrators","date":1437698819956,"synopsis":"Here we collect advice for operating wiki sites for others. Computers and networks vary so we stop short of step by step instructions. We report what has worked for us using the privileges available to system administrators."},{"slug":"title","title":"Title","date":1423059789707,"synopsis":"A wiki page has a title that is used to identify it as it is copied from site to site."},{"slug":"track-changes","title":"Track Changes","date":1418315338671,"synopsis":"You can always edit. Your edits will be stored in the browser or on the origin server if you've logged in."},{"slug":"transport-plugin","title":"Transport Plugin","date":1451555653265,"synopsis":"The Transport Plugin is the name given to the plugin idea initially described here:"},{"slug":"twins","title":"Twins","date":1423371901220,"synopsis":"Twins are pages from different sites that have the same or sufficiently similar names. Twins may or may not have a common origin."},{"slug":"understand-welcome-visitors","title":"Understand Welcome Visitors","date":1423509751134,"synopsis":"Welcome Visitors is one of a few special system pages. Welcome Visitors is meant to identify what your site is about to others. It also may function as a personal landing page. See [[Special Page Names]]"},{"slug":"upper-name-hierarchy","title":"Upper Name Hierarchy","date":1418599789015,"synopsis":"The federation is held together by consistent use of structured names within name spaces. Here we explain its upper reaches: domains, pages, items and the plugins that interpret them. See also [[Abstraction of Method]]"},{"slug":"use-arrow-keys","title":"Use Arrow Keys","date":1423267115029,"synopsis":"This is an easy one. We're going to learn how to use keys to navigate. See [[What Arrow Keys Look Like]]."},{"slug":"use-conversation-clubs","title":"Use Conversation Clubs","date":1423777847407,"synopsis":"You should have a \"Conversation Clubs\" link on your site from previous steps in the orientation."},{"slug":"using-a-wiki-for-your-notebook","title":"Using a Wiki For your Notebook","date":1454581575506,"synopsis":"[http://webseitz.fluxent.com/ Bill Seitz] says:"},{"slug":"using-federated-wiki","title":"Using Federated Wiki","date":1454431944121,"synopsis":"Mike Caulfield runs federated Wiki \"Happenings\" - here are some very useful basic notes:"},{"slug":"view-remote-pages","title":"View Remote Pages","date":1423509657525,"synopsis":"You've probably noticed that some of these pages have a \"blue halo\" around them. This means that the data of the page is being served from a server other than the one from which you're browsing (your [[Origin Site]])."},{"slug":"virtues-of-wiki","title":"Virtues of Wiki","date":1423006428713,"synopsis":"First, federated wiki inherits the virtues of wiki:"},{"slug":"web-page","title":"Web Page","date":1421112840681,"synopsis":"The wiki browser is a web application that finds and edits wiki pages. The application fits within a web page and is run as a single-page application."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1563258800440,"synopsis":"Welcome to this [[Federated Wiki]] site - personal site for [[Julian Elve]]. I am using this for general note-taking and experiments with [[Federated Wiki]]."},{"slug":"where-numbers-live","title":"Where Numbers Live","date":1420515970697,"synopsis":"Wiki stores numbers in json and shares them through http requests. We see a lot of variety in how numbers get into json and what happens to them after they are fetched."},{"slug":"where-pages-live","title":"Where Pages Live","date":1420345697537,"synopsis":"We describe where the json representing a wiki page can be stored and how pages move between these stores."},{"slug":"wiki-page","title":"Wiki Page","date":1440986648088,"synopsis":"A wiki page is content specifically designed to be easily authored and combined with other similarly formatted pages to be viewed as a hypertext."},{"slug":"models-of-society","title":"Models of Society","date":1563257543986,"synopsis":"[[David Ronfeldt]] [[TIMN]] model of social evolution"}]