[{"slug":"a-fedwiki-style-sheet","title":"A FedWiki Style Sheet","date":1446402506869,"synopsis":"Here we present for refinement some of the fundamental writing practices for a FedWiki genre. The wiki genre facilitates readers and writers aiming to capture, share, and reuse networked community knowledge."},{"slug":"about-federated-wiki","title":"About Federated Wiki","date":1469224975210,"synopsis":"We remain excited about this platform and have become increasingly confident that it embodies important new ideas. We will explain."},{"slug":"about-flags","title":"About Flags","date":1414108983976,"synopsis":"Wiki uses flags where other sites might use icons. Flags all have a family resemblance: squares of solid color with a gentle gradient. Flags always stand for navigating to specific sites within the federation."},{"slug":"about-forks","title":"About Forks","date":1414111236863,"synopsis":"We share responsibility for pages by passing them between sites with the hope that they will be improved with every hop. Here we consider what to expect from such sharing and how that might break down."},{"slug":"about-plugins","title":"About Plugins","date":1392495427696,"synopsis":"We explain federated wiki plugins. We define their role interpreting content, recount our experience writing many, describe principles and strategies for future plugins, and offer a step-by-step guide for new plugin authors. We'll also collect pointers here to good plugins when they emerge."},{"slug":"about-provenance","title":"About Provenance","date":1414118102433,"synopsis":"Wiki uses domain names as the identity of individuals or organizations in the federation. We are pretty sure of the domain name for sites we contact directly. If we trust that site then we can work back further."},{"slug":"about-this-site","title":"About This Site","date":1563814878346,"synopsis":"This site serves to pull together ideas about [[Personal Knowledge Management]] (PKM)"},{"slug":"abstract","title":"Abstract","date":1573503466159,"synopsis":"\"And there is not, in human nature, a separate mental realm that reasons <b>abstract</b>ly about the physical realm.\""},{"slug":"abstraction-of-method","title":"Abstraction of Method","date":1418598926711,"synopsis":"We reflect on the various ways this wiki separates method from quantity such that what will be done can be considered independently from the doing. We focus on dispatch as a kind of condition that is open to an increasing number of alternatives that will be managed by other than the immediate programmer. See also [[Upper Name Hierarchy]]."},{"slug":"advanced-work","title":"Advanced work","date":1419792050774,"synopsis":"Elso Kilpi questions the cultural metaphors that guide our actions at work and in society as belonging to an outmoded industrial era. Creative, knowledge-based work crosses traditional organisational boundaries: organisations are emergent self-organising processes. [https://medium.com/@EskoKilpi/advanced-work-5ac3d810fe49 essay]."},{"slug":"alan-kays-tape-reel","title":"Alan Kay's Tape Reel","date":1413381371459,"synopsis":"Federated Wiki implements an idea similar to that expressed by Alan Kay at OOPSLA '97: the Internet as a version of the 1961 B220 file format he observed in the Air Force in 1961."},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"apoptosis","title":"Apoptosis","date":1413987576020,"synopsis":"Also known as Programmed Cell Death. The principle is that every \"healthy\" cell (or computer in a muticellular computing network) must be prepared to suicide if needed for the benefit of the organism as a whole because, after all, we are talking about multicellular architecture here."},{"slug":"are-domain-names-trustworthy","title":"Are Domain Names Trustworthy","date":1414118087793,"synopsis":"domain names can be forged by atackers"},{"slug":"are-site-operators-trustworthy","title":"Are Site Operators Trustworthy","date":1414118102436,"synopsis":"site operators might not protect their site from others"},{"slug":"assignments","title":"Assignments","date":1424389993030,"synopsis":"This is the methodology we'll be using for this Happening."},{"slug":"association","title":"Association","date":1573410974282,"synopsis":"\"The central idea of <b>association</b>ism is this: two things that are relevantly [[similar]] become connected in the mind.\""},{"slug":"attributing-catalysts","title":"Attributing Catalysts","date":1563350057843,"synopsis":"In the face of the [[Information Torrent]], [[Knowledge Catalysts]]  / [[Curators]] play an essential role in [[Knowledge Network]]s"},{"slug":"attributing-sources","title":"Attributing Sources","date":1563350888929,"synopsis":"Where did this idea originate? Attribution of source is both good practice, but reinforces the network as it rewards the creators of information."},{"slug":"attribution-in-pkm","title":"Attribution in PKM","date":1563350657905,"synopsis":"Effective PKM relies on [[Building a Knowledge Network]]. Attribution is the glue that holds networks together"},{"slug":"authority-from-trail-climbing","title":"Authority from Trail Climbing","date":1414134582317,"synopsis":"We favor mobility of expression over compounding of citations. Where history is explicit and explorable few words need be further spent on the subject. We leave it to the reader to seek the source and then judge themselves whether authority has waxed or waned."},{"slug":"barriers-to-effective-pkm","title":"Barriers to Effective PKM","date":1563262563071,"synopsis":"What are the factors that undermine effective personal knowledge management?"},{"slug":"beyond-personal-attribution","title":"Beyond Personal Attribution","date":1424110579824,"synopsis":"In federated wiki, authorship is [[Discoverable but not Obvious]]. And even where it is discoverable, authorship is complex. For that reason we suggest you consider alternatives to personal attribution when you write. We suggest some such alternatives here."},{"slug":"blue-plane","title":"Blue Plane","date":1562260767445,"synopsis":"A story of the Grand Canyon."},{"slug":"boltzmann","title":"Boltzmann","date":1573467751069,"synopsis":"\"[[Association]] mechanisms: Hebbian, back propagation, <b>Boltzman</b>, contiguity\""},{"slug":"bookmark-key-pages","title":"Bookmark Key Pages","date":1423508994832,"synopsis":"This really isn't an optional step, although people tend to skip over anything that tells them to bookmark a page. I'm not sure why."},{"slug":"broadcast-workflow","title":"Broadcast Workflow","date":1418623044728,"synopsis":"We explain how to create a broadcast channel to address a community from a position of authority. Our protocol includes acknowledgement of receipt and moderated comments."},{"slug":"categorising-things","title":"Categorising  Things","date":1563521266804,"synopsis":"How do we categorise chunks of knowledge in a [[Personal Learning Environment]] ?"},{"slug":"choose-the-right-browser","title":"Choose the Right Browser","date":1423508325183,"synopsis":"Federated Wiki uses fairly advanced HTML to accomplish what it does. In our experience, only Chrome and Firefox provide good experiences."},{"slug":"chorus-of-voices","title":"Chorus of Voices","date":1419791919094,"synopsis":"Four distinct concerns surface when designing federated wiki based information communities. We identify each and suggest forces that must be resolved before creative collaboration will take place."},{"slug":"claim-the-joy","title":"Claim the Joy","date":1563296097343,"synopsis":"Being in the [[Flow]] is a joyful experience. It's challenging, but it vitalizes us - leaves us with more energy, not less."},{"slug":"claiming-authorship","title":"Claiming Authorship","date":1563350768500,"synopsis":"At a basic level, [[Tell People What You Did]]"},{"slug":"clean-up-welcome-visitors","title":"Clean up Welcome Visitors","date":1423508920105,"synopsis":"If you are using a site hosted by fedwikihappening.net, we put some extra paragraphs on your Welcome Visitors page."},{"slug":"colleagues","title":"Colleagues","date":1521981529798,"synopsis":"A page with 0 items."},{"slug":"collectors-fallacy","title":"Collectors Fallacy","date":1587454843278,"synopsis":"The mis-guided belief that merely collecting reading material (or links to material) means that we have assimilated the knowledge in that material."},{"slug":"comfortable-being-uncomfortable","title":"Comfortable being Uncomfortable","date":1563033568911,"synopsis":"As someone embarks on a true learning journey, consider this rule number one: One must become comfortable being uncomfortable."},{"slug":"commenting","title":"Commenting","date":1423762497344,"synopsis":"There is no single stream on federated wiki, so commenting in federated wiki should be used for comments on the document, not for extended back and forth discussion."},{"slug":"commonplace-book","title":"Commonplace Book","date":1554470718969,"synopsis":"Commonplace books were originally the preserve of male scholars who used them to keep notes as they learned; but gradually their use spread beyond universities and by the 18th century commonplace books were also used by educated women."},{"slug":"community-documentation-of-federated-wiki","title":"Community Documentation of Federated Wiki","date":1421455197126,"synopsis":"[[Understanding the Factory]]"},{"slug":"composing-across-pages-or-cross-page-refactoring","title":"Composing Across Pages or Cross Page Refactoring","date":1424214764559,"synopsis":"YOUTUBE _lviuozVf98"},{"slug":"composing-and-editing-in-federated-wiki","title":"Composing and Editing in Federated Wiki","date":1420474644382,"synopsis":"The basic elements of a Federated Wiki page are text paragraphs, images, videos, headers, page dividers, and links either to other pages in Federated Wiki or to external webpages."},{"slug":"composing-lineups","title":"Composing Lineups","date":1419785626179,"synopsis":"We might call that URL a [[Passively Constructed URL]], because it just records your navigation through FedWiki space."},{"slug":"composing-on-fedwiki-m-c-morgan","title":"Composing on FedWiki (M C Morgan)","date":1456243081304,"synopsis":"In which I start to gather notes for a re-thinking of procedures and patterns for writing using FedWiki. The distributed document network shifts the rhetoric in un-probed ways.  This ain't no Meatball Wiki."},{"slug":"connected","title":"Connected","date":1573476592204,"synopsis":"\"two major types of knowledge: qualitative and quantitative. [[Distributed]] knowledge adds a third major category to this domain, knowledge that could be described as <b>connective</b>.\" ..."},{"slug":"connectivism","title":"Connectivism","date":1574062821863,"synopsis":""},{"slug":"constellate-dissertation-pages","title":"Constellate Dissertation Pages","date":1433877109124,"synopsis":"Start with [https://books.google.com/books?id=e3YoAgAAQBAJ&pg=PA45&lpg=PA45&dq=gutenberg+galaxy+mosaic&source=bl&ots=o6OVhvMp-T&sig=QzYn_6CEJ2_x4tRSgkgF6vBamO0&hl=en&sa=X&ei=HDB3Ver8BK3lsAS1-YHYAQ&ved=0CFwQ6AEwDw#v=onepage&q=gutenberg%20galaxy%20mosaic&f=false Jessica Pressman on Gutenberg Galaxy], a quote from McLuhan."},{"slug":"constructivism","title":"Constructivism","date":1563814310539,"synopsis":"www.learning-theories.com"},{"slug":"contributions-to-pkm-from-neuroscience","title":"Contributions to PKM from NeuroScience","date":1579096226780,"synopsis":"For example consider work of [[Efrat Furst]]"},{"slug":"create-and-claim-a-site","title":"Create and Claim a Site","date":1423508417552,"synopsis":"Down at the bottom of your page (the [[Footer]]) there is a blue button (the [[Login]]). On systems running our Node code, it will say either \"Sign In\" \"Sign Out\" or \"Claim with your Email\"."},{"slug":"creative-commons","title":"Creative Commons","date":1414110280837,"synopsis":"If you want to give people the right to share, use, and even build upon a work you’ve created, you should consider publishing it under a Creative Commons license. [http://creativecommons.org/about website]"},{"slug":"creative-confidence","title":"Creative Confidence","date":1562782937495,"synopsis":"Creative confidence is critical for the learning process. For [[Deeper Learning]]."},{"slug":"curator","title":"Curator","date":1563348130189,"synopsis":"An individual who selects knowledge artifacts and presents them within a context.  Closely related to [[Knowledge Catalyst]]."},{"slug":"curiosity","title":"Curiosity","date":1562173960952,"synopsis":"[[Deeper Learning]] begins with curiosity. When our curiosity is ignited, our minds are literally transformed, as neurotransmitters activate key parts of our brain's analytical and memory areas. We are able to learn faster and retain better what we are learning."},{"slug":"cyberyota","title":"Cyberyota","date":1413988237353,"synopsis":"In 2006 [[Steve Burbeck]] suggested that a wiki devoted to the application of multicellular innovation to modern problems in computing might be a useful extension of a report he had written on the subject. Cyberyota was born. [http://c2.com/w4/cyberyota/ website]"},{"slug":"david-ronfeldt","title":"David Ronfeldt","date":1563207086276,"synopsis":"Professional status: retired from RAND since 2008."},{"slug":"deleting-me-softly","title":"Deleting me softly","date":1419217836446,"synopsis":"We consider the many ways that we might delete a wiki page. We've got to get this right."},{"slug":"dialectic-mode","title":"Dialectic Mode","date":1152087641000,"synopsis":"A variant of [[Thread Mode]] in which the participants are [[Dramatic Identity]]s rather than real people; a conversation between characters in a play. You, the reader, are encouraged to become playwright and improve the dialog, if you can."},{"slug":"dialectical-synthesis","title":"Dialectical Synthesis","date":1562781594439,"synopsis":"The concept of Dialectical Synthesis is derived from the Hegelian dialectic."},{"slug":"discoverable-but-not-obvious","title":"Discoverable but not Obvious","date":1423771876859,"synopsis":"Identity and citation has to be discoverable -- that's part of the deal, the BY in the CC-BY-SA. But it does not follow that citation should be obvious. In fact, there are many reasons to to background citation."},{"slug":"dissertation-over-discourse","title":"Dissertation Over Discourse","date":1419243045794,"synopsis":"A play on words meaning, of course, that [[Document Mode]] is more important than [[Thread Mode]] but suggesting also to put [[Summaries On Top Discussion Below]]."},{"slug":"dissertation-over-discourse-in-fedwiki","title":"Dissertation Over Discourse in FedWiki","date":1433874858682,"synopsis":"Remixed from  [http://maha.uk.fedwikihappening.net/view/welcome-visitors/view/dissertation-over-discourse Dissertation Over Discourse here]."},{"slug":"distributed","title":"Distributed","date":1573413230174,"synopsis":"\"The concept of 'redness' is an example of <b>distributed</b> meaning. There is no particular place we could point to where the 'meaning' of 'redness' is located. (We could say ‘meaning’ = ‘connective similarity’?)\""},{"slug":"diversity-in-service","title":"Diversity in Service","date":1421896336413,"synopsis":"We consider what one might expect of a federated wiki server under diverse circumstances. We hope a brief reflection will guide improvements in servers, clients and the protocols between them."},{"slug":"ebb-and-flow","title":"Ebb and flow","date":1573479781897,"synopsis":"\"What is needed is to attain a middle point, where full connectivity is achieved, but where impulses in the network <b>ebb and flow</b>, where impulses generated by phenomena are checked against not one but a multitude of competing and even contradictory impulses.\""},{"slug":"edit-welcome-visitors","title":"Edit Welcome Visitors","date":1423161217592,"synopsis":"Depending on your site's configuration, your Welcome Visitors page will either have two gray boxes on it (underneath Pages About Us and Places Were We Share) or have \"dummy\" text in those areas, such as \"Your Name Here\"."},{"slug":"efrat-furst","title":"Efrat Furst","date":1579096505188,"synopsis":"Efrat Furst"},{"slug":"embed-video","title":"Embed Video","date":1423266509800,"synopsis":"Embedding video is similar to adding an image. Instead of dragging and dropping an image onto [[Factory]], however, you are going to drag and drop a URL."},{"slug":"emergent","title":"Emergent","date":1573476652284,"synopsis":"\"<b>Emergence</b> is a hard concept, but at this point I can gloss it with a simple characterization: emergence is [[interpretation]] applied to connections.\" "},{"slug":"emergent-value-in-proliferation","title":"Emergent Value in Proliferation","date":1414133749829,"synopsis":"The tradition in computing has been to avoid duplication for fear that inconsistency would emerge in the presents of change. We prefer to explore and exploit that inconsistency considering it a primary feature of wiki."},{"slug":"escaping-addresses","title":"Escaping Addresses","date":1460902644990,"synopsis":"The ability to reliably address all elements of a collection gives computers an air of logical certainty. However, over dependence on these properties have blinded system designers to larger scale patterns."},{"slug":"escaping-streammode","title":"Escaping StreamMode","date":1455176417949,"synopsis":"Noticing an increasing number of references to the almost ubiquitous presence of [[Stream Mode]]"},{"slug":"eureka-moments","title":"Eureka Moments","date":1562692924017,"synopsis":"The Eureka Moments when and individual or a team has a sudden rush of insight that lays clear the solution to a complex problem  or the answer to a perplexing question."},{"slug":"execute-a-cross-page-move","title":"Execute a Cross-Page Move","date":1423588296537,"synopsis":"You can drag paragraphs up and down. Try it with these paragraphs. Click, hold, drag, then drop."},{"slug":"expectation-of-service","title":"Expectation of Service","date":1414140406308,"synopsis":"Wiki works when viewed as a new way to serve rather than a new thing to consume. Our works are a gift to those who bother to care. That that might happen, now or in the future, is reward enough."},{"slug":"familiar-workflows","title":"Familiar Workflows","date":1469302451800,"synopsis":"Many simple things that could be a button in a centralized system turn into a series of steps in federated wiki. We'll catalog them here as we notice them."},{"slug":"federated-wiki-and-reflection","title":"Federated Wiki and Reflection","date":1401421133471,"synopsis":"In [[Reflections]], the wiki is discussed as a form of personal reflection. I've got a good decade and a half thinking about  net-enabled reflection in education, so I thought I'd add my two cents."},{"slug":"federated-wiki-design-principles","title":"Federated Wiki Design Principles","date":1414173411719,"synopsis":"We have concentrated on a small number of idealistic principles, beliefs even, while ignoring considerable established practice. Only by such intense focus can we expect to find fresh solutions to persistent problems."},{"slug":"federated-wiki-is-an-application","title":"Federated Wiki is an Application","date":1401032236864,"synopsis":"Federated Wiki exists within the browser (for the time being) but subverts certain notions of the web. It should not be judged as a series of web pages, but as a new breed of application."},{"slug":"federated-wiki-is-your-high-school-journal","title":"Federated Wiki Is Your High School Journal","date":1401064400749,"synopsis":"If you are debating whether to put something into your federated wiki, the answer is simple: put it in."},{"slug":"federated-wiki-knowledge-cycle","title":"Federated Wiki knowledge cycle","date":1454422887295,"synopsis":"Some examples:"},{"slug":"federated-wiki-neighborhoods","title":"Federated Wiki Neighborhoods","date":1454595492991,"synopsis":"The Neighborhood (sic) is the network of sites that your site is related to - it's where search looks, and it changes dynamically."},{"slug":"federated-wikis-the-universal-canvas-and-bens-five-star-plugin","title":"Federated Wikis, the Universal Canvas, and Ben's Five Star Plugin","date":1405112934702,"synopsis":"I’ve borrowed Jon Udell’s term (“universal canvas”) for talking about SFW (a term that was initially coined by Microsoft). In this video I talk about a plugin my brother Ben wrote for SFW earlier this week, and try to show what that means in semi-mechanical terms."},{"slug":"fedwiki-isnt-designed-for-discussion","title":"FedWiki Isn't Designed for Discussion","date":1433875839069,"synopsis":"FedWiki is not built to support multiparty discussion. Traditional wikis support it weakly by using delimiters and a style guide, and perhaps FedWiki will develop similar indicators of processes. But a dedicated discussion space might support thread mode better than the wiki page. Wikipedia has talk pages. The thread mode is near by but separate from the dissertation, which makes the dissertation more useful to readers and makes the thread mode more useful to writers. \"Useful\" meaning it facilitates creating a better crafted dissertation mode, one that c"},{"slug":"fedwiki-the-big-picture","title":"Fedwiki: The Big Picture","date":1563811837982,"synopsis":"Mike Caulfield's thoughts, large and small, about fedwiki especially in blended learning."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1453132719653,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content:"},{"slug":"first-tips-for-newbies","title":"First tips for newbies","date":1420437999651,"synopsis":"This page is for people who are new to #fedwiki but were unable to join the happening when Mike and Ward were available to support us."},{"slug":"first-write-who--what","title":"First Write Who & What","date":1420300140822,"synopsis":"New sites are born with a single page that encourages the creation of two more, who and what. Here I reflect on the wisdom of that guidance."},{"slug":"flow","title":"Flow","date":1562081799987,"synopsis":"The concept of Flow was developed by Mihály Csíkszentmihályi (pronounced “CHICK-sent-me-high-ee”). In his book, *Flow: The Psychology of Optimal Experience*, he writes:"},{"slug":"folk-memory","title":"Folk Memory","date":1420512203216,"synopsis":"This memo describes an adaptive architecture for federating peer object servers. Both the architecture and its implementations are called Folk Memory. This term alludes to the social process by which folk tales or folk songs are remembered and propagated within a culture. [http://c2.com/doc/FolkMemory.pdf pdf]"},{"slug":"foundations","title":"Foundations","date":1574062766563,"synopsis":"Forked from Matthias Melcher [http://wiki.mmelcher.org/view/welcome-visitors  wiki]"},{"slug":"garden","title":"Garden","date":1563523140151,"synopsis":"<< find other uses of Garden metaphor >>"},{"slug":"getting-started-with-federated-wiki","title":"Getting Started with Federated Wiki","date":1522224482526,"synopsis":"For a basic introduction that contextualises [[Federated Wiki]] in knowledge-sharing and educational contexts, a lot of the writings of <a href=\"http://hapgood.us/\">Mike Caulfield</a> are worth checking out."},{"slug":"half-baked-ideas","title":"Half Baked Ideas","date":1586269674904,"synopsis":"Practising PKM as a flowing series of half-baked ideas can encourage innovation and reduce the feeling that our exposed knowledge has to be ‘executive presentation perfect’ [http://jarche.com/2015/03/innovation-means-learning-at-work/ blog]"},{"slug":"happy-accidents","title":"Happy Accidents","date":1414136953129,"synopsis":"Serendipity is the property of finding useful things not asked or sought for. Federated Wiki generates serendipity through fortuitous collisions of names."},{"slug":"hebb","title":"Hebb","date":1573470811972,"synopsis":"\"[[Association]] mechanisms: <b>Hebbian</b>, back propagation, Boltzman, contiguity\" "},{"slug":"high-awareness-in-foraging","title":"High Awareness in Foraging","date":1421896428899,"synopsis":"We seek an active reader willing to interpret incomplete, fragmented and contradictory works. The thoroughness of long-form writing compensates for publication friction that has vanished. Better to return quickly and frequently to a thought than struggle to wring all value out at once."},{"slug":"hospitable-hypertext","title":"Hospitable Hypertext","date":1424362294572,"synopsis":"Hospitality is the effort one makes to have those not at home feel at home. On the web, notions of hospitality are inextricably bound up with charity of language, interpretation, and discourse style. While wiki focuses on the needs of writers, it also encourages writers to write in a hospitable way."},{"slug":"how-federated-wiki-neighborhoods-grow-and-change","title":"How Federated Wiki neighborhoods grow and change","date":1454595662758,"synopsis":"[http://blog.jonudell.net/ Jon Udell] writes:"},{"slug":"how-networks-learn","title":"How Networks Learn","date":1430757656805,"synopsis":"Stephen Downes explains Connectivism as Learning Theory. [http://halfanhour.blogspot.ca/2014/04/connectivism-as-learning-theory.html post]"},{"slug":"how-to-add-this-page-to-your-site","title":"How to add this page to your site","date":1454596254555,"synopsis":"The basic logic for adding a page from another [[Federated Wiki]] is described in [[Copy Pages]]"},{"slug":"how-to-take-smart-notes","title":"How to Take Smart Notes","date":1589265082158,"synopsis":"Documents a [[personal knowledge management]] approach heavily based on [[Zettelkasten]]."},{"slug":"how-word-gets-around","title":"How Word Gets Around","date":1420343668507,"synopsis":"I often surprise myself at how pages and page names float around among the dozens of sites I've built for myself. I've got to enumerate these flows and will do so here."},{"slug":"hypertext-history","title":"Hypertext History","date":1424220251152,"synopsis":"Assignment is below. If you have not done an assignment yet, you should look see [[Assignments]]."},{"slug":"ideas-of-federated-wiki","title":"Ideas of Federated Wiki","date":1423008702213,"synopsis":"Federated Wiki combines a few powerful, well-chosen ideas. It's helpful to know what these are. Most of these ideas exist someplace else, the particular power is the combination of the ideas in a single environment."},{"slug":"import-annotations","title":"Import Annotations","date":1414117770261,"synopsis":"When import scripts are long, complex or rerun often we benefit from recording within imported pages details of the import process."},{"slug":"import-documents","title":"Import Documents","date":1421896517883,"synopsis":"Federated wiki is just one more document format that hopes to play well with others and bring something new to the party."},{"slug":"in-a-nutshell","title":"In a Nutshell","date":1423446914649,"synopsis":"Federated Wiki is less like Microsoft Word, and more like Excel."},{"slug":"incremental-paragraphs","title":"Incremental Paragraphs","date":1420512381493,"synopsis":"A complete thought is more important than a complete sentence. Write to be read in progress. Expect your work to be consumed and discarded before it is finished."},{"slug":"infer","title":"Infer","date":1573561055181,"synopsis":"\"The creation of scepticism creates the requirement that we <b>infer</b> from the mental to the physical\" "},{"slug":"inspirations","title":"Inspirations","date":1563811735488,"synopsis":"<i>For each list of sites, click the >> to add to the search neighbourhood</i>"},{"slug":"integrative-learning","title":"Integrative Learning","date":1563523976959,"synopsis":"wikipedia"},{"slug":"journal-actions","title":"Journal Actions","date":1414091033075,"synopsis":"Wiki is an editor. It need not figure out what others have done. It needs only to remember what it has done. That makes reconstructing history easy."},{"slug":"journal-as-history-visualized","title":"Journal as History Visualized","date":1420512431664,"synopsis":"I reflect on why hardly a day goes by when I am not asked if it wouldn't be possible to hide the Journal. My position has been that it should be more present, more beautiful, more of a guide to knowing. What is it that people expect from a computer?"},{"slug":"journal-spacers","title":"Journal Spacers","date":1420512473920,"synopsis":"Add spacers to the journal for hour ⌚, day ☀, week ☽, month ⚪, season ⚘ and year ❄. Also separate actions with no date data ✇. Add these to Activity plugin headings as a key."},{"slug":"json-schema","title":"JSON Schema","date":1422391934107,"synopsis":"We define the schema for federated wiki pages to the depth that we know it. We use a BNF-like notation to suggest JSON elements. Any ambiguity will be resolved by examining the example. We close with a brief reflection on the successes of the format."},{"slug":"julian-elve","title":"Julian Elve","date":1522061747740,"synopsis":"[https://twitter.com/Synesthesia @synesthesia]"},{"slug":"katas-for-slow-sense-making","title":"Katas for slow sense-making","date":1573826509211,"synopsis":"Expand on the thoughts from **Two speeds of sense-making** [http://localhost:1313/2019/11/15/two-speeds-of-sense-making/ blog]"},{"slug":"know-possible-traps","title":"Know Possible Traps","date":1423160832532,"synopsis":"Federated Wiki should be regarded as a Developer Release or Technology Preview. Expect certain things to go wrong. Roll with it...."},{"slug":"knowledge","title":"Knowledge","date":1563519509033,"synopsis":"For the purposes of [[Personal Knowledge Management]], Knowledge can be defined as \"actionable information\""},{"slug":"knowledge-catalyst","title":"Knowledge Catalyst","date":1563348156214,"synopsis":"An individual who combines sources to identify tentative new knowledge, then re-shares to a network. See also [[Curator]]"},{"slug":"knowledge-work-should-accrete","title":"Knowledge work should accrete","date":1587464814458,"synopsis":"Andy Matuschack"},{"slug":"kuhn-cycle","title":"Kuhn Cycle","date":1451851237849,"synopsis":"Thomas Kuhn's Structure of Scientific Revolutions described the social cycle through which science advances, one stage of which is the paradigm shift for which he is famous."},{"slug":"laptop-server","title":"Laptop Server","date":1431392897772,"synopsis":"Federation makes even tiny wiki sites valuable. To feel this value, make some sites. Experiment. Keep the ones you like. Here I reflect on three years of doing this myself."},{"slug":"learn-shift-click-magic","title":"Learn Shift-Click Magic","date":1423420575219,"synopsis":"Modifier keys are used heavily in Federated Wiki. Shift-click is one such modifier key. To use it, hold down your shift key while executing your normal click action."},{"slug":"lineup","title":"Lineup","date":1414087573468,"synopsis":"We line up wiki pages as we browse through links. The result, the lineup, has both visual and computational implications."},{"slug":"lineup-browsing","title":"Lineup Browsing","date":1538750694125,"synopsis":"We maintain browsing context when following links by stacking new pages upon old. The resulting [[Lineup]] scrolls as needed. A list of links needs less explanation when a peek into deeper content is so easy."},{"slug":"lineup-computing","title":"Lineup Computing","date":1414097874849,"synopsis":"All pages in the [[Lineup]] are available to javascript in the browser. A page that wants data looks left in the lineup for pages with data to offer. Data then flows left to right."},{"slug":"lineup-editing","title":"Lineup Editing","date":1414135928885,"synopsis":"We show multiple wiki pages in a single web page. This [[Lineup]] of pages lets us do drag-and-drop refactoring of deeply-nested content."},{"slug":"link-from-seek-to-sense","title":"Link From Seek to Sense","date":1587471691942,"synopsis":"Seeking without Sense-making is an example of the [[Collectors Fallacy]]"},{"slug":"link-word","title":"Link Word","date":1418937425265,"synopsis":"Wiki has a distinct markup for links that go to pages outside the wiki. Here we suggest a style for using that markup that suites both writer and reader."},{"slug":"locality-of-voice-and-jargon","title":"Locality of Voice and Jargon","date":1414138425242,"synopsis":"Each site becomes a space an individual fills with thoughts, original and adapted, but ultimately in their own voice and familiar jargon."},{"slug":"logistic-curve","title":"Logistic Curve","date":1413304463316,"synopsis":"Up until March 2007, many people believed Wikipedia's growth to be exponential. Changes in the rate of growth has prompted a re-evaluation of that, and the current belief is that Wikipedia's growth fits a logisitic-linear growth model."},{"slug":"long-term-memory","title":"Long Term Memory","date":1579193249764,"synopsis":"Term used by many, including [[Efrat Furst]] to refer to the elements of brain function that relate to the long term storage of memories."},{"slug":"look-at-sfw-like-ada-lovelace","title":"Look at SFW like Ada Lovelace","date":1403654966378,"synopsis":"In a presentation at New Relic, [[Ward Cunningham]] breaks into the middle of the talk to explain why Ada Lovelace was the first programmer."},{"slug":"make-an-encyclopedic-page","title":"Make an Encyclopedic Page","date":1423589608371,"synopsis":"In this activity we will make a simple encyclopedic page."},{"slug":"make-an-index-page","title":"Make an Index Page","date":1423530313650,"synopsis":"Index pages are used as entry points into your site's content. In pedagogical uses of federated wiki it can also function as a portfolio of student work. Here we show you how to make one."},{"slug":"make-your-bio-page","title":"Make Your Bio Page","date":1423177730902,"synopsis":"Your bio page helps users to understand who you are and why you might be running this site. This is how to make one."},{"slug":"making-meaning","title":"Making Meaning","date":1589266172783,"synopsis":"The role of meaning-making in establishing links between new concepts and existing knowledge."},{"slug":"markets-and-networks","title":"Markets and Networks","date":1563257543984,"synopsis":"[[Shallow Knowledge]]"},{"slug":"meaning-makers","title":"Meaning Makers","date":1562776675483,"synopsis":"Life is a mystery. We walk our solitary path in the hope that our lives will have a meaning for ourselves and, ultimately, for others."},{"slug":"meaning-matrix","title":"Meaning Matrix","date":1562350873013,"synopsis":"In his talk _How to Invent the Future_ Kay talked about oblique thought planes, what he called Pink and [[Blue Plane]]s. This concept integrates with Koestler's metaphor of \"matrices of thought\" that he explored in his book,  _The Act of Creation_. We can think of these matrices existing on distinct planes - each being a different domain of thought in a moment of time."},{"slug":"messaging","title":"Messaging","date":1413989356598,"synopsis":"Communication and collaboration is based upon exchange of polymorphic messages rather than exchange of \"executable\" code (DNA/RNA in the case of biological cells, machine code in the case of computing."},{"slug":"mixed-content","title":"Mixed Content","date":1495816475450,"synopsis":"Wiki extends its twenty year old namesake by providing an unbounded complement of markups of which only a few offer specific syntax for formatting text. The remaining markups configure plugins to show or do work we usually associate with applications."},{"slug":"models-of-society","title":"Models of Society","date":1563257543986,"synopsis":"[[David Ronfeldt]] [[TIMN]] model of social evolution"},{"slug":"mutable-linear-form","title":"Mutable Linear Form","date":1414126460566,"synopsis":"We demand the simplicity of unidimensional sequence for that makes most decisions reduce to one of priority. Markup struggles under page layout notations when the page is wide and must be filled for efficiency. Rather than limitation, linear form is a gift to the next editor."},{"slug":"names-of-things","title":"Names of Things","date":1423066945612,"synopsis":"We throw around a lot of terms when we talk about federated wiki that come from a variety of sources. Here we look at the sources and mention the most common names they provide."},{"slug":"neighborhoods","title":"Neighborhoods","date":1495803971171,"synopsis":"Pages move freely throughout the federation which we subdivide into regions of various scale so as to have the pages we want and avoid the pages that would conflict or distract."},{"slug":"niklas-luhmann","title":"Niklas Luhmann","date":1586251050356,"synopsis":"[https://en.wikipedia.org/wiki/Niklas_Luhmann Wikipedia]"},{"slug":"ontology-v-stigmergy","title":"Ontology v. Stigmergy","date":1563521230911,"synopsis":"[[Ontology]] deals with questions concerning what entities exist or may be said to exist and how such entities may be grouped, related within a hierarchy, and subdivided according to similarities and differences. [https://en.wikipedia.org/wiki/Ontology wikipedia]"},{"slug":"open-education","title":"open education","date":1401405339058,"synopsis":"The term Open Education is an umbrella term for many things, most of which are related to the idea of creating more flexible and net-enabled learning experiences."},{"slug":"paradigm-shift","title":"Paradigm Shift","date":1557945828693,"synopsis":"The book itself represented a paradigm shift."},{"slug":"permanent-note-writing-as-a-fundamental-unit-of-knowledge-work","title":"Permanent note-writing as a fundamental unit of knowledge work","date":1586250194437,"synopsis":"Andy Matuschak"},{"slug":"permanent-notes","title":"Permanent Notes","date":1589211171695,"synopsis":"Persistent notes that capture concepts as they make sense to the author. We aim for a note to express clearly the essence of a concept."},{"slug":"permanent-notes-should-be-atomic","title":"Permanent Notes Should Be Atomic","date":1589265312965,"synopsis":"A [[Permanent note]] should be about one thing (i.e. one concept) and aim to capture the entirety of that thing."},{"slug":"permanent-notes-should-be-concept-based","title":"Permanent Notes Should be Concept-Based","date":1589266829513,"synopsis":"We consider that it is better to create [[Permanent Notes]] by concept than by other factors such as author or source to support [[Serendipitous Retrieval]]."},{"slug":"permanent-notes-should-be-densely-linked","title":"Permanent Notes Should Be Densely Linked","date":1589266132934,"synopsis":"Adding links to notes requires us to think about what other concepts might be linked to the concept we are writing."},{"slug":"personal-dynamic-media","title":"Personal Dynamic Media","date":1422911020985,"synopsis":"A term coined by [[Alan Kay]] to describe a way of using computers.  In Early History Of Smalltalk, Alan Kay explains how after seeing Seymour Papert's work with [[Logo Language]] he grew to see personal computing less as a \"personal dynamic vehicle\" and more as a \"personal dynamic medium\".  Instead of the computer being primarily used for its capacity to perform computation, what if it were used as a medium for communication?  Not just as a way for people to send each other text, or pictures, or sound, but as a way to send each other active, \"live\" simu"},{"slug":"personal-knowledge-management","title":"Personal Knowledge Management","date":1591782450008,"synopsis":"Applying a conscious set of processes to the acquisition, classification, development, repurposing and sharing of new, personally-applicable [[knowledge]]."},{"slug":"practice","title":"Practice","date":1573477248939,"synopsis":"\"<b>Over time</b>, if we see something that is [[similar]], like we see a cat every day, a characteristic set of connections between neurons will form. Makes sense? See a cat, get a certain pattern of connections. "},{"slug":"preservation","title":"Preservation","date":1421896660450,"synopsis":"Creating duplicate copies of data on one or more systems is called replication, one of several strategies for preserving digital content. [http://en.wikipedia.org/wiki/Digital_preservation#Strategies wikipedia]"},{"slug":"profligate-copying","title":"Profligate Copying","date":1469245903238,"synopsis":"We disregard the industry tradition of normalizing data and refactoring code in order to avoid duplication. We instead look to life and culture for creative inspiration."},{"slug":"question-formulation-technique","title":"Question Formulation Technique","date":1580237887371,"synopsis":"See Right Question Institute [https://rightquestion.org/what-is-the-qft/ site]"},{"slug":"radical-discourse","title":"Radical Discourse","date":1433874897718,"synopsis":"What we might have given up in [[Rethinking ThreadMode]] and [[Rethinking DocumentMode]] we regain in Radical Discourse. The idea is that when dissertation pages are linked up, constellated, we create the larger, multi-voiced discourse."},{"slug":"read-a-journal-history","title":"Read a Journal History","date":1423600478651,"synopsis":"You've probably noticed (how could you not?) that there are some weird symbols at the bottom of the Federated wiki page. This section is called the [[Journal]] and it can be extremely useful to you. Here's how it works."},{"slug":"recognition","title":"Recognition","date":1573479496646,"synopsis":"\"Knowledge is <b>recognition</b>\""},{"slug":"reconsolidation","title":"Reconsolidation","date":1589354480476,"synopsis":""},{"slug":"reference-notes","title":"Reference Notes","date":1587470982035,"synopsis":"When following a process similar to [[Zettelkasten]] Reference Notes are a key bridge between sources and the generative work of creating and maintaining [[evergreen notes]]."},{"slug":"reflection","title":"Reflection","date":1573470555449,"synopsis":"\"Knowledge in the mind is not a matter of mere numbers of neurons being activated by a certain phenomenon; it is an ocean of competing and conflicting possible organizations, each ebbing and subsiding ([[ebb and flow]]) with any new input (or even upon <b>reflection</b>).\""},{"slug":"reflection-workflow","title":"Reflection Workflow","date":1574015820751,"synopsis":"A reflection captures thoughts at the end of an activity. This workflow suggests how writing and rereading reflections enhances systematic understanding."},{"slug":"reflections","title":"Reflections","date":1420300260522,"synopsis":"We imagine federated wiki as a medium for authoring, distributing and consuming reports."},{"slug":"reflective-interviews","title":"Reflective Interviews","date":1419218542528,"synopsis":"It is easier to get a creative person to explain their creativity in the context of an actual creative event. Describe the kind of creativity that interests you then seise from their recollections the event most likely to touch your interests."},{"slug":"reinventing-status-reports","title":"Reinventing Status Reports","date":1420516103825,"synopsis":"I've promoted federated wiki as a better corporate wiki. Here I consider how a burst of creativity might be recalled and then documented based on wiki's recent-changes. I'll call this form a \"reflection\"."},{"slug":"reliability","title":"Reliability","date":1573477662403,"synopsis":"\"the mechanism for attaining the <b>reliability</b> of connective knowledge is fundamentally the same as that of attaining reliability in other areas; the promotion of diversity, through the empowering of individual entities, and the reduction in the influence of well-connected entities\""},{"slug":"rename-workflow","title":"Rename Workflow","date":1418910479603,"synopsis":"When you find a better name for a page, write about why that is a better name, make the page, then drag the important stuff from the old to the new."},{"slug":"representations","title":"Representations","date":1573477058227,"synopsis":"\"Consider a hockey game. We have memories of hockey, thoughts of hockey, but we don't actually have a hockey game in our head."},{"slug":"rethinking-composing-in-fedwiki","title":"Rethinking Composing in FedWiki","date":1433777346723,"synopsis":"FedWiki doesn't work the same way the traditional wiki works, and works even less like paper than traditional wikis."},{"slug":"rethinking-documentmode","title":"Rethinking DocumentMode","date":1426262818490,"synopsis":"We rethink DocumentMode as a synthesis of thread mode ideas brought to an end and view it as one position in a larger constellation of ideas."},{"slug":"rethinking-threadmode","title":"Rethinking ThreadMode","date":1433862469715,"synopsis":"We rethink the traditional idea of thread mode as a conversation that moves towards document mode exposition."},{"slug":"roles-in-pkm","title":"Roles in PKM","date":1563348174935,"synopsis":"An individual who combines sources to identify tentative new knowledge, then re-shares to a network. See also [[Curator]]"},{"slug":"schema","title":"Schema","date":1562690921007,"synopsis":"Kant first introduced the concept of schema. It is the internal landscape that we use to interpret the world around us.  How we make sense of our perceptions."},{"slug":"seek","title":"Seek","date":1587453794357,"synopsis":"In terms of [[Personal Knowledge Management]]"},{"slug":"seek-sense-share","title":"Seek Sense Share","date":1587469881145,"synopsis":"A model of [[Personal Knowledge Management]]"},{"slug":"semantic","title":"Semantic","date":1573499658546,"synopsis":"\"Connectivism attempts to describe what is *actually* happening in thought and consciousness (because it's not a <b>semantically</b> based language of thought).\""},{"slug":"sensations-from-anywhere","title":"Sensations from anywhere","date":1573499639741,"synopsis":"\"We don't just sense what we see, feel, touch, etc.; our <b>sensations</b> might arise out of interactions among neurons <b>anywhere</b> in the brain.\"  ... "},{"slug":"sense","title":"Sense","date":1587560783109,"synopsis":"In terms of [[Personal Knowledge Management]], aka [[Sense-Making]]"},{"slug":"sense-making","title":"Sense-Making","date":1574059435780,"synopsis":"Synonym for [[Sense]] in the context of [[Personal Knowledge Management]]"},{"slug":"serendipitous-namespace-collisions","title":"Serendipitous Namespace Collisions","date":1414026901801,"synopsis":"Serendipity is the property of finding useful things not asked or sought for. Federated Wiki generates serendipity through neighborhood namespace collisions."},{"slug":"shallow-knowledge","title":"Shallow Knowledge","date":1563208067125,"synopsis":"In terms of non-academic knowledge the same often happens when following a link to a newspaper paywall - further learning stops."},{"slug":"share","title":"Share","date":1563522943327,"synopsis":"A page with 0 items."},{"slug":"signed-versions","title":"Signed Versions","date":1414118054984,"synopsis":"cryptographic methods connecting wiki to other trust networks"},{"slug":"similar","title":"Similar","date":1573477353958,"synopsis":"\"The central idea of [[association]] is this: two things that are relevantly <b>similar</b> become connected in the mind.\""},{"slug":"simple-rules","title":"Simple Rules","date":1424448250280,"synopsis":"Simple rules can lead to complex behavior and vise versa. We reflect on why we want a few biologically inspired rules to govern federated wiki."},{"slug":"site-index","title":"Site Index","date":1454425438178,"synopsis":"SORT titles"},{"slug":"social","title":"Social","date":1573503305312,"synopsis":"\"What makes some knowledge part of '<b>social</b> knowldge' and other knowledge (merely?) personal knowledge? Why would a community accept ([[reliability]]) some things as 'known' and not others?\" "},{"slug":"specialization","title":"Specialization","date":1413989306335,"synopsis":"As multicellularity evolves and the organisms become more complex, the individual elements whether cells, individual insects in colonies, or individual computers in complex networks, tend to specialize and become simpler."},{"slug":"state-mode","title":"StateMode","date":1455177115561,"synopsis":"cf [[Stream Mode]]"},{"slug":"status-deployment-report","title":"Status Deployment Report","date":1360004950463,"synopsis":"We've asked our friends at New Relic to try using federated wiki for internal communications. Here I report on wiki improvements motivated by this collaboration."},{"slug":"status-interpretation","title":"Status Interpretation","date":1360963566461,"synopsis":"We consider the role of a first level manager as both producer and consumer of status."},{"slug":"stigmergy","title":"Stigmergy","date":1413987328450,"synopsis":"Multicellular organisms, whether biological or computing, co-exist and co-evolve with external structures that are created by and, in turn, influence the behavior of the \"cells.\""},{"slug":"stream","title":"Stream","date":1563522965586,"synopsis":"see [[Stream Mode]]"},{"slug":"stream-mode","title":"Stream Mode","date":1563523164283,"synopsis":"The tendency of social media tools to present content as a chronological stream."},{"slug":"structures","title":"Structures","date":1469458189941,"synopsis":"Wiki's roots go back to pattern languages where pages represent information that can be applied in the context created by its antecedents. We extend application to computations performed by plugins using data found before it in the lineup."},{"slug":"subsymbolic","title":"Subsymbolic","date":1573477485563,"synopsis":"\"meaning, both socially and neurally, have the same origin: meaning is an emergent phenomenon, arising from the connections between [[underlying entities]]. Socially, the underlying entities are speakers of the language, while mentally, the underlying entities are neurons and <b>subsymbolic</b> neural structures.\""},{"slug":"teaching-with-learning-in-mind","title":"Teaching with Learning in Mind","date":1579528683384,"synopsis":"A series of notes and presentations from [[Efrat Furst]] exploring the neuroscientific basis of learning:"},{"slug":"tell-people-what-you-did","title":"Tell People What You Did","date":1423602462327,"synopsis":"One approach to credit is simply to Tell People What You Did. This is applicable to wiki, and to life in general. When it matters, citation can be usually sourced and demonstrated."},{"slug":"test-multi-word-page-name","title":"test multi word page name","date":1522223152443,"synopsis":"A page with 0 items."},{"slug":"the-garden-and-the-stream","title":"The Garden and the Stream","date":1581492836316,"synopsis":"Metaphor applied by Mike Caulfield to contrast the serial nature of much social media with the cyclical growth and nurture that is possible with more personal platforms such as [[Federated Wiki]] [https://hapgood.us/2015/10/17/the-garden-and-the-stream-a-technopastoral/ blog]"},{"slug":"the-hidden-history-of-online-learning","title":"The Hidden History of Online Learning","date":1522224067873,"synopsis":"Context"},{"slug":"things-you-must-do","title":"Things You Must Do","date":1454485890130,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Mike Caulfield has linked directly to the things he suggested candidates should do/be able to do before the training event he ran - the \"March Happening\", in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"thinking-vs-writing","title":"Thinking vs. Writing","date":1421897542830,"synopsis":"We compare the thought process of problem solving to those of reporting solutions."},{"slug":"timn","title":"TIMN","date":1563206994342,"synopsis":"David Ronfeldt"},{"slug":"tools-for-personal-knowledge-management","title":"Tools for Personal Knowledge Management","date":1563814831880,"synopsis":"Examples of [[Federated Wiki knowledge cycle]]"},{"slug":"topic-split-workflow","title":"Topic Split Workflow","date":1424231408857,"synopsis":"When you discover that a topic is too big for one wiki page then you can split the page into two."},{"slug":"twin-pages","title":"Twin Pages","date":1414014942384,"synopsis":"Pages that share the same name are called twins. Federated wiki offers several affordances that helps one acknowledge twins and move freely between them."},{"slug":"two-tales-of-two-forks","title":"Two Tales of Two Forks","date":1420774570294,"synopsis":"I am not suggesting that there is one way to fork"},{"slug":"underlying-entities","title":"Underlying entities","date":1573489276181,"synopsis":"\"if a human mind can come to 'know', and if a human mind is, essentially, a network, then any network can come to 'know', and for that matter, so can a society.\""},{"slug":"understanding-links","title":"Understanding Links","date":1420762486675,"synopsis":"Links help keep individual pages short and on point."},{"slug":"understanding-the-journal","title":"Understanding the Journal","date":1420431837358,"synopsis":"#What is the Journal?"},{"slug":"understanding-twins","title":"Understanding Twins","date":1420855016994,"synopsis":"Twins are pages in your neighborhood that have the same name. In most cases, but not all, they are older or newer revisions of the page you are looking at."},{"slug":"universal","title":"Universal","date":1573482493178,"synopsis":"\"The Cartesian view - the nature of, and the behaviour of things (language, logic, mathematics, physics) was explained by <b>universals</b>. This fails (cf Hume).\""},{"slug":"upper-name-hierarchy","title":"Upper Name Hierarchy","date":1418599789015,"synopsis":"The federation is held together by consistent use of structured names within name spaces. Here we explain its upper reaches: domains, pages, items and the plugins that interpret them. See also [[Abstraction of Method]]"},{"slug":"use-arrow-keys","title":"Use Arrow Keys","date":1423267115029,"synopsis":"This is an easy one. We're going to learn how to use keys to navigate. See [[What Arrow Keys Look Like]]."},{"slug":"use-conversation-clubs","title":"Use Conversation Clubs","date":1423777847407,"synopsis":"You should have a \"Conversation Clubs\" link on your site from previous steps in the orientation."},{"slug":"using-federated-wiki-for-pkm","title":"Using Federated Wiki for PKM","date":1563346651800,"synopsis":"Writing in FedWiki"},{"slug":"via-attribution","title":"Via Attribution","date":1434728595679,"synopsis":"One solution to attribution is to give credit to the person whose site you found it on. Instead of \"Jon Udell writes that federated wiki is like Tumblr in that...\" try \"Via Jon Udell, federated wiki is like Tumblr in that...\" This acknowledges that you found it through Jon Udell, and gives it some authority based on Jon's curation/editing of it. It points people to the version you are responding to as well. But it avoids claiming Jon as the author or the direct asserter of the statement. Via asserts only that Jon has published this and found it of note."},{"slug":"view-remote-pages","title":"View Remote Pages","date":1423509657525,"synopsis":"You've probably noticed that some of these pages have a \"blue halo\" around them. This means that the data of the page is being served from a server other than the one from which you're browsing (your [[Origin Site]])."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1589214748484,"synopsis":"This  [[Federated Wiki]] site pulls together my notes on [[Personal Knowledge Management]]. See [[About this Site]] for jumping-off points into the content."},{"slug":"what-has-changed-in-fedwiki","title":"What Has Changed in FedWiki","date":1434220890644,"synopsis":"A consideration of changed affordances in fedwiki and how they tend to influence practice. It's not enough to say, \"Everything has changed.\" It hasn't, and the beauty is considering what those changes mean."},{"slug":"wiki-multipage-editing","title":"Wiki Multipage Editing","date":1360832507000,"synopsis":"<i>Editing more than one page at a time can be done by Federation</i>"},{"slug":"wiki-vandalism-solutions","title":"Wiki Vandalism Solutions","date":1421897681142,"synopsis":"Federated Wiki promises to address many of these opportunities. We'll dig into each of these suggestions and make sure the new wiki avails itself to these thoughts from the original."},{"slug":"workflows","title":"Workflows","date":1469302410737,"synopsis":"Workflows describe productive activities that are well supported but not enforced by wiki."},{"slug":"working-with-fedwiki","title":"Working With Fedwiki","date":1420951986684,"synopsis":"A few things we've learned. We are Opinionated Wiki, but the opinions often come from painful lessons learned."},{"slug":"writing-is-core-to-learning","title":"Writing Is Core To Learning","date":1587463341085,"synopsis":">Writing is not what follows research, learning or studying, it is the medium of all this work."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429288732439,"synopsis":"Writing in the presence of rampant forking calls into question what it means to write and how to do it well."},{"slug":"zettelkasten","title":"Zettelkasten","date":1587470000984,"synopsis":"A [[personal knowledge management]] process."},{"slug":"zettelkasten-project","title":"Zettelkasten project","date":1586250877905,"synopsis":"Using a Zettelkasten is about optimizing a workflow of learning and producing knowledge. The products are texts, mostly. The categories we find fit the process well at the moment are the following:"},{"slug":"permanent-notes-should-develop-iteratively","title":"Permanent Notes should develop iteratively","date":1589353862453,"synopsis":"The [[quality of permanent notes]] is improved through more-frequent, cheaper feedback. Iterative development of these notes benefits from the effect that [[iterative development of knowledge artefacts increases feedback]]"},{"slug":"iterative-development-of-knowledge-artifacts-increases-feedback","title":"Iterative Development of Knowledge Artifacts Increases Feedback","date":1589265050229,"synopsis":"Frequency of feedback is increased by the frequency with which successive states of a knowledge artifact are exposed to review by observers."},{"slug":"quality-of-permanent-notes","title":"Quality of Permanent Notes","date":1589265350150,"synopsis":"We suggest the quality of [[Permanent Notes]] is based on both the accuracy of expression of an atomic idea ([[permanent notes should be atomic]]) and the quality of cross-linking with other concepts ([[permanent notes should be densely linked]])."},{"slug":"retrieval-practice","title":"Retrieval Practice","date":1589269321517,"synopsis":"A strategy to strengthen concepts in [[long term memory]] by trying to recall them, thus reinforcing the neurological access pathways."},{"slug":"revisiting-permanent-notes-encourages-deeper-linking","title":"Revisiting Permanent Notes Encourages Deeper Linking","date":1589354516868,"synopsis":"Each time we visit a [[Permanent Note]] we may see new connections, or revise existing ones."},{"slug":"application-of-reconsolidation-effects","title":"Application of Reconsolidation Effects","date":1589354472606,"synopsis":"[[Efrat Furst]] suggests that for practical application of the [[reconsolidation]] effect to acquiring new knowledge the following steps are required:"},{"slug":"models-of-learning","title":"Models of Learning","date":1591782471031,"synopsis":"[[Didau's Taxonomy]]"},{"slug":"didaus-taxonomy","title":"Didau's Taxonomy","date":1591782476335,"synopsis":"A page with 0 items."}]