[{"slug":"about-federated-wiki","title":"About Federated Wiki","date":1469224975210,"synopsis":"We remain excited about this platform and have become increasingly confident that it embodies important new ideas. We will explain."},{"slug":"about-this-site","title":"About This Site","date":1522319617364,"synopsis":"This site serves to pull together ideas about [[Personal Knowledge Management]]"},{"slug":"all-pages-in-neighborhood","title":"All Pages in Neighborhood","date":1423760208993,"synopsis":"We've talked about the Neighborhood, but have not gone into it in great detail. Here we talk about what the Neighborhood is, and how to list all pages in it."},{"slug":"assignments","title":"Assignments","date":1424389993030,"synopsis":"This is the methodology we'll be using for this Happening."},{"slug":"bookmark-key-pages","title":"Bookmark Key Pages","date":1423508994832,"synopsis":"This really isn't an optional step, although people tend to skip over anything that tells them to bookmark a page. I'm not sure why."},{"slug":"broadcast-workflow","title":"Broadcast Workflow","date":1418623044728,"synopsis":"We explain how to create a broadcast channel to address a community from a position of authority. Our protocol includes acknowledgement of receipt and moderated comments."},{"slug":"categorising--things","title":"Categorising  Things","date":1522067178174,"synopsis":"How do we categorise chunks of knowledge in a [[Personal Learning Environment]] ?"},{"slug":"choose-the-right-browser","title":"Choose the Right Browser","date":1423508325183,"synopsis":"Federated Wiki uses fairly advanced HTML to accomplish what it does. In our experience, only Chrome and Firefox provide good experiences."},{"slug":"clean-up-welcome-visitors","title":"Clean up Welcome Visitors","date":1423508920105,"synopsis":"If you are using a site hosted by fedwikihappening.net, we put some extra paragraphs on your Welcome Visitors page."},{"slug":"colleagues","title":"Colleagues","date":1521981529798,"synopsis":"A page with 0 items."},{"slug":"commenting","title":"Commenting","date":1423762497344,"synopsis":"There is no single stream on federated wiki, so commenting in federated wiki should be used for comments on the document, not for extended back and forth discussion."},{"slug":"community-documentation-of-federated-wiki","title":"Community Documentation of Federated Wiki","date":1421455197126,"synopsis":"[[Understanding the Factory]]"},{"slug":"composing-and-editing-in-federated-wiki","title":"Composing and Editing in Federated Wiki","date":1420474644382,"synopsis":"The basic elements of a Federated Wiki page are text paragraphs, images, videos, headers, page dividers, and links either to other pages in Federated Wiki or to external webpages."},{"slug":"create-and-claim-a-site","title":"Create and Claim a Site","date":1423508417552,"synopsis":"Down at the bottom of your page (the [[Footer]]) there is a blue button (the [[Login]]). On systems running our Node code, it will say either \"Sign In\" \"Sign Out\" or \"Claim with your Email\"."},{"slug":"edit-welcome-visitors","title":"Edit Welcome Visitors","date":1423161217592,"synopsis":"Depending on your site's configuration, your Welcome Visitors page will either have two gray boxes on it (underneath Pages About Us and Places Were We Share) or have \"dummy\" text in those areas, such as \"Your Name Here\"."},{"slug":"embed-video","title":"Embed Video","date":1423266509800,"synopsis":"Embedding video is similar to adding an image. Instead of dragging and dropping an image onto [[Factory]], however, you are going to drag and drop a URL."},{"slug":"escaping-streammode","title":"Escaping StreamMode","date":1455176417949,"synopsis":"Noticing an increasing number of references to the almost ubiquitous presence of [[Stream Mode]]"},{"slug":"execute-a-cross-page-move","title":"Execute a Cross-Page Move","date":1423588296537,"synopsis":"You can drag paragraphs up and down. Try it with these paragraphs. Click, hold, drag, then drop."},{"slug":"familiar-workflows","title":"Familiar Workflows","date":1469302451800,"synopsis":"Many simple things that could be a button in a centralized system turn into a series of steps in federated wiki. We'll catalog them here as we notice them."},{"slug":"federated-wiki-knowledge-cycle","title":"Federated Wiki knowledge cycle","date":1454422887295,"synopsis":"Some examples:"},{"slug":"federated-wiki-neighborhoods","title":"Federated Wiki Neighborhoods","date":1454595492991,"synopsis":"The Neighborhood (sic) is the network of sites that your site is related to - it's where search looks, and it changes dynamically."},{"slug":"fedwiki-the-big-picture","title":"Fedwiki: The Big Picture","date":1413311593289,"synopsis":"[[Federated Wiki Is an Application]]. It is not a web page or series of web pages. This has some implications on interface and use."},{"slug":"fedwiki-tools","title":"Fedwiki Tools","date":1453132719653,"synopsis":"Here we list a few tools that are of particular use in managing and creating [[Fedwiki]] content:"},{"slug":"first-tips-for-newbies","title":"First tips for newbies","date":1420437999651,"synopsis":"This page is for people who are new to #fedwiki but were unable to join the happening when Mike and Ward were available to support us."},{"slug":"getting-started-with-federated-wiki","title":"Getting Started with Federated Wiki","date":1522224482526,"synopsis":"For a basic introduction that contextualises [[Federated Wiki]] in knowledge-sharing and educational contexts, a lot of the writings of <a href=\"http://hapgood.us/\">Mike Caulfield</a> are worth checking out."},{"slug":"how-federated-wiki-neighborhoods-grow-and-change","title":"How Federated Wiki neighborhoods grow and change","date":1454595662758,"synopsis":"[http://blog.jonudell.net/ Jon Udell] writes:"},{"slug":"how-to-add-this-page-to-your-site","title":"How to add this page to your site","date":1454596254555,"synopsis":"The basic logic for adding a page from another [[Federated Wiki]] is described in [[Copy Pages]]"},{"slug":"hypertext-history","title":"Hypertext History","date":1424220251152,"synopsis":"Assignment is below. If you have not done an assignment yet, you should look see [[Assignments]]."},{"slug":"ideas-of-federated-wiki","title":"Ideas of Federated Wiki","date":1423008702213,"synopsis":"Federated Wiki combines a few powerful, well-chosen ideas. It's helpful to know what these are. Most of these ideas exist someplace else, the particular power is the combination of the ideas in a single environment."},{"slug":"in-a-nutshell","title":"In a Nutshell","date":1423446914649,"synopsis":"Federated Wiki is less like Microsoft Word, and more like Excel."},{"slug":"inspirations","title":"Inspirations","date":1522228931635,"synopsis":"<i>For each list of sites, click the >> to add to the search neighbourhood</i>"},{"slug":"know-possible-traps","title":"Know Possible Traps","date":1423160832532,"synopsis":"Federated Wiki should be regarded as a Developer Release or Technology Preview. Expect certain things to go wrong. Roll with it...."},{"slug":"kuhn-cycle","title":"Kuhn Cycle","date":1451851237849,"synopsis":"Thomas Kuhn's Structure of Scientific Revolutions described the social cycle through which science advances, one stage of which is the paradigm shift for which he is famous."},{"slug":"learn-shift-click-magic","title":"Learn Shift-Click Magic","date":1423420575219,"synopsis":"Modifier keys are used heavily in Federated Wiki. Shift-click is one such modifier key. To use it, hold down your shift key while executing your normal click action."},{"slug":"make-an-encyclopedic-page","title":"Make an Encyclopedic Page","date":1423589608371,"synopsis":"In this activity we will make a simple encyclopedic page."},{"slug":"make-an-index-page","title":"Make an Index Page","date":1423530313650,"synopsis":"Index pages are used as entry points into your site's content. In pedagogical uses of federated wiki it can also function as a portfolio of student work. Here we show you how to make one."},{"slug":"make-your-bio-page","title":"Make Your Bio Page","date":1423177730902,"synopsis":"Your bio page helps users to understand who you are and why you might be running this site. This is how to make one."},{"slug":"mixed-content","title":"Mixed Content","date":1495816475450,"synopsis":"Wiki extends its twenty year old namesake by providing an unbounded complement of markups of which only a few offer specific syntax for formatting text. The remaining markups configure plugins to show or do work we usually associate with applications."},{"slug":"names-of-things","title":"Names of Things","date":1423066945612,"synopsis":"We throw around a lot of terms when we talk about federated wiki that come from a variety of sources. Here we look at the sources and mention the most common names they provide."},{"slug":"neighborhoods","title":"Neighborhoods","date":1495803971171,"synopsis":"Pages move freely throughout the federation which we subdivide into regions of various scale so as to have the pages we want and avoid the pages that would conflict or distract."},{"slug":"ontology-v-stigmergy","title":"Ontology v. Stigmergy","date":1522067159482,"synopsis":"Ontology deals with questions concerning what entities exist or may be said to exist and how such entities may be grouped, related within a hierarchy, and subdivided according to similarities and differences. [https://en.wikipedia.org/wiki/Ontology wikipedia]"},{"slug":"personal-dynamic-media","title":"Personal Dynamic Media","date":1422911020985,"synopsis":"A term coined by [[Alan Kay]] to describe a way of using computers.  In Early History Of Smalltalk, Alan Kay explains how after seeing Seymour Papert's work with [[Logo Language]] he grew to see personal computing less as a \"personal dynamic vehicle\" and more as a \"personal dynamic medium\".  Instead of the computer being primarily used for its capacity to perform computation, what if it were used as a medium for communication?  Not just as a way for people to send each other text, or pictures, or sound, but as a way to send each other active, \"live\" simu"},{"slug":"personal-knowledge-management","title":"Personal Knowledge Management","date":1522228559685,"synopsis":"Applying a conscious process to the development of new, personally-applicable knowledge"},{"slug":"profligate-copying","title":"Profligate Copying","date":1469245903238,"synopsis":"We disregard the industry tradition of normalizing data and refactoring code in order to avoid duplication. We instead look to life and culture for creative inspiration."},{"slug":"read-a-journal-history","title":"Read a Journal History","date":1423600478651,"synopsis":"You've probably noticed (how could you not?) that there are some weird symbols at the bottom of the Federated wiki page. This section is called the [[Journal]] and it can be extremely useful to you. Here's how it works."},{"slug":"reflection-workflow","title":"Reflection Workflow","date":1420301013460,"synopsis":"A reflection captures thoughts at the end of an activity. This workflow suggests how writing and rereading reflections enhances systematic understanding."},{"slug":"reflective-interviews","title":"Reflective Interviews","date":1419218542528,"synopsis":"It is easier to get a creative person to explain their creativity in the context of an actual creative event. Describe the kind of creativity that interests you then seise from their recollections the event most likely to touch your interests."},{"slug":"rename-workflow","title":"Rename Workflow","date":1418910479603,"synopsis":"When you find a better name for a page, write about why that is a better name, make the page, then drag the important stuff from the old to the new."},{"slug":"seek","title":"Seek","date":1522747004263,"synopsis":"In terms of [[Personal Knowledge Management]]"},{"slug":"seek-sense-share","title":"Seek Sense Share","date":1522223472637,"synopsis":"[[Seek]]"},{"slug":"sense","title":"Sense","date":1522323320704,"synopsis":"In terms of [[Personal Knowledge Management]]"},{"slug":"simple-rules","title":"Simple Rules","date":1424448250280,"synopsis":"Simple rules can lead to complex behavior and vise versa. We reflect on why we want a few biologically inspired rules to govern federated wiki."},{"slug":"site-index","title":"Site Index","date":1454425438178,"synopsis":"SORT titles"},{"slug":"statemode","title":"StateMode","date":1455177115561,"synopsis":"cf [[Stream Mode]]"},{"slug":"stream-mode","title":"Stream Mode","date":1455176995976,"synopsis":"The tendency of social media tools to present content as a chronological stream."},{"slug":"structures","title":"Structures","date":1469458189941,"synopsis":"Wiki's roots go back to pattern languages where pages represent information that can be applied in the context created by its antecedents. We extend application to computations performed by plugins using data found before it in the lineup."},{"slug":"test-multi-word-page-name","title":"test multi word page name","date":1522223152443,"synopsis":"A page with 0 items."},{"slug":"the-hidden-history-of-online-learning","title":"The Hidden History of Online Learning","date":1522224067873,"synopsis":"Context"},{"slug":"things-you-must-do","title":"Things You Must Do","date":1454485890130,"synopsis":"You can wander all day in the federation, and it's easy to get sidetracked. Mike Caulfield has linked directly to the things he suggested candidates should do/be able to do before the training event he ran - the \"March Happening\", in a nice linear style. You can still wander if you want, but if you want to do the minimum, go through this list, skip the byways, and you will be set."},{"slug":"topic-split-workflow","title":"Topic Split Workflow","date":1424231408857,"synopsis":"When you discover that a topic is too big for one wiki page then you can split the page into two."},{"slug":"two-tales-of-two-forks","title":"Two Tales of Two Forks","date":1420774570294,"synopsis":"I am not suggesting that there is one way to fork"},{"slug":"understanding-links","title":"Understanding Links","date":1420762486675,"synopsis":"Links help keep individual pages short and on point."},{"slug":"understanding-the-journal","title":"Understanding the Journal","date":1420431837358,"synopsis":"#What is the Journal?"},{"slug":"understanding-twins","title":"Understanding Twins","date":1420855016994,"synopsis":"Twins are pages in your neighborhood that have the same name. In most cases, but not all, they are older or newer revisions of the page you are looking at."},{"slug":"use-arrow-keys","title":"Use Arrow Keys","date":1423267115029,"synopsis":"This is an easy one. We're going to learn how to use keys to navigate. See [[What Arrow Keys Look Like]]."},{"slug":"use-conversation-clubs","title":"Use Conversation Clubs","date":1423777847407,"synopsis":"You should have a \"Conversation Clubs\" link on your site from previous steps in the orientation."},{"slug":"view-remote-pages","title":"View Remote Pages","date":1423509657525,"synopsis":"You've probably noticed that some of these pages have a \"blue halo\" around them. This means that the data of the page is being served from a server other than the one from which you're browsing (your [[Origin Site]])."},{"slug":"welcome-visitors","title":"Welcome Visitors","date":1522599089083,"synopsis":"From this page you can find who we are and what we do. New sites provide this information and then claim the site as their own. You will need your own site to participate."},{"slug":"workflows","title":"Workflows","date":1469302410737,"synopsis":"Workflows describe productive activities that are well supported but not enforced by wiki."},{"slug":"working-with-fedwiki","title":"Working With Fedwiki","date":1420951986684,"synopsis":"A few things we've learned. We are Opinionated Wiki, but the opinions often come from painful lessons learned."},{"slug":"writing-with-strangers","title":"Writing with Strangers","date":1429288732439,"synopsis":"Writing in the presence of rampant forking calls into question what it means to write and how to do it well."}]